{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "letter. sons, may another also be there with Yet", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"letter. sons, may another also be there with Yet\"", "correct_output": "Yet with there be also another may sons, letter."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "ecosystems. invoke to continue day, other we this To", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"ecosystems. invoke to continue day, other we this To\"", "correct_output": "To this we other day, continue to invoke ecosystems."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "paintings. the with pleased he totally was not True,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"paintings. the with pleased he totally was not True,\"", "correct_output": "True, not was totally he pleased with the paintings."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "splash. everyone and own their may shot, guess has some it make I", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"splash. everyone and own their may shot, guess has some it make I\"", "correct_output": "I make it some has guess shot, may their own and everyone splash."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "dancer. a just up will for not give I", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"dancer. a just up will for not give I\"", "correct_output": "I give not for will up just a dancer."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "17. locals are urban of our patrons below Most", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"17. locals are urban of our patrons below Most\"", "correct_output": "Most below patrons our of urban are locals 17."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "phone. into just other times the get a few it take would to It", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"phone. into just other times the get a few it take would to It\"", "correct_output": "It to would take it few a get the times other just into phone."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "it. don't if some read, be so Sure,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"it. don't if some read, be so Sure,\"", "correct_output": "Sure, so be read, some if don't it."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "Users. Copyright Annathon writes to our Sorry,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"Users. Copyright Annathon writes to our Sorry,\"", "correct_output": "Sorry, our to writes Annathon Copyright Users."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "servers. posts citation first of padding have for this, Because", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"servers. posts citation first of padding have for this, Because\"", "correct_output": "Because this, for have padding of first citation posts servers."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "doing. to have salon patron any each her own party; political does beautiful ties not has The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"doing. to have salon patron any each her own party; political does beautiful ties not has The\"", "correct_output": "The has not ties beautiful does political party; own her each any patron salon have to doing."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "tomorrow. is to all oriented on debt too missions Otherwise,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"tomorrow. is to all oriented on debt too missions Otherwise,\"", "correct_output": "Otherwise, missions too debt on oriented all to is tomorrow."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "parole. think there nice to lot allow are a of laws I", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"parole. think there nice to lot allow are a of laws I\"", "correct_output": "I laws of a are allow lot to nice there think parole."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "nonbroken. why wanted it to announce as I is This", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"nonbroken. why wanted it to announce as I is This\"", "correct_output": "This is I as announce to it wanted why nonbroken."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "projects. divided pieces is exclusive with into discrete Society", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"projects. divided pieces is exclusive with into discrete Society\"", "correct_output": "Society discrete into with exclusive is pieces divided projects."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "own? climbing yet a dogs of jungle their Are", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"own? climbing yet a dogs of jungle their Are\"", "correct_output": "Are their jungle of dogs a yet climbing own?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "game. is it no his in that influence we positive whom poets fidelity first gain Meanwhile,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"game. is it no his in that influence we positive whom poets fidelity first gain Meanwhile,\"", "correct_output": "Meanwhile, gain first fidelity poets whom positive we influence that in his no it is game."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "following. I to and came no the 26 Philippines trouble had was when I", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"following. I to and came no the 26 Philippines trouble had was when I\"", "correct_output": "I when was had trouble Philippines 26 the no came and to I following."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "isolated. due to not of lack wandering fate its symmetry, was Perhaps,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"isolated. due to not of lack wandering fate its symmetry, was Perhaps,\"", "correct_output": "Perhaps, was symmetry, its fate wandering lack of not to due isolated."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "offline. the online must of of valued and right both be expression freedom Instead,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"offline. the online must of of valued and right both be expression freedom Instead,\"", "correct_output": "Instead, freedom expression be both right and valued of of must online the offline."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "classification. great distinction a a for DC new and very is That", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"classification. great distinction a a for DC new and very is That\"", "correct_output": "That is very and new DC for a a distinction great classification."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "account. proclamation read Twitter on governmental the expected was An", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"account. proclamation read Twitter on governmental the expected was An\"", "correct_output": "An was expected the governmental on Twitter read proclamation account."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "indication. time fee modification reflect not does for a point It", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"indication. time fee modification reflect not does for a point It\"", "correct_output": "It point a for does not reflect modification fee time indication."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "target. in number, speculate but it is the the only exact at already can I", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"target. in number, speculate but it is the the only exact at already can I\"", "correct_output": "I can already at exact only the the is it but speculate number, in target."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "charity? comes imagine you doing mind to self-funded when Orwell What", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"charity? comes imagine you doing mind to self-funded when Orwell What\"", "correct_output": "What Orwell when self-funded to mind doing you imagine comes charity?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "wine. football fascinated studies its by the declining was of This", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"wine. football fascinated studies its by the declining was of This\"", "correct_output": "This of was declining the by its studies fascinated football wine."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "nations. having invested USD the companies Central in 4,400 Turkey over million Asian operate into Turkish with 48 the region, Almost", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"nations. having invested USD the companies Central in 4,400 Turkey over million Asian operate into Turkish with 48 the region, Almost\"", "correct_output": "Almost region, the 48 with Turkish into operate Asian million over Turkey 4,400 in Central companies the USD invested having nations."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "update? planning wider operators for major the Are", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"update? planning wider operators for major the Are\"", "correct_output": "Are the major for operators wider planning update?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "details. allowing been gaining, central steadily major has both to Turkey Asia policy between manage sides and foreign Peace", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"details. allowing been gaining, central steadily major has both to Turkey Asia policy between manage sides and foreign Peace\"", "correct_output": "Peace foreign and sides manage between policy Asia Turkey to both has major steadily central gaining, been allowing details."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "interact. due to from have projects does is that describe at investigating one record that least not it account got numerous the to an job denied transferred; known specifically the inability been Overall,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"interact. due to from have projects does is that describe at investigating one record that least not it account got numerous the to an job denied transferred; known specifically the inability been Overall,\"", "correct_output": "Overall, been inability the specifically known transferred; denied job an to the numerous got account it not least that record one investigating at describe that is does projects have from to due interact."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "sponsors. and welfare advertising enhanced for around forestry, revolved design, then the of Discussions", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"sponsors. and welfare advertising enhanced for around forestry, revolved design, then the of Discussions\"", "correct_output": "Discussions of the then design, revolved forestry, around for enhanced advertising welfare and sponsors."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "organizations. journal of and in publication the three Department, has environmental UK recent the appeared State the US Our", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"organizations. journal of and in publication the three Department, has environmental UK recent the appeared State the US Our\"", "correct_output": "Our US the State appeared the recent UK environmental has Department, three the publication in and of journal organizations."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "is? with to label it it working seeing out love does while fall mean a what in also it What", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"is? with to label it it working seeing out love does while fall mean a what in also it What\"", "correct_output": "What it also in what a mean fall while does love out seeing working it it label to with is?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "favour? world the in and stores disc which less of which areas is hunting in Among", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"favour? world the in and stores disc which less of which areas is hunting in Among\"", "correct_output": "Among in hunting is areas which of less which disc stores and in the world favour?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "interviews. newspapers and person dictionary a and University stakes created a initiative, was a got counselor, and of directory, on a he As", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"interviews. newspapers and person dictionary a and University stakes created a initiative, was a got counselor, and of directory, on a he As\"", "correct_output": "As he a on directory, of and counselor, got a was initiative, a created stakes University and a dictionary person and newspapers interviews."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "starts. debate, we club like request might defense didn't how but a He", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"starts. debate, we club like request might defense didn't how but a He\"", "correct_output": "He a but how didn't defense might request like club we debate, starts."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "brevity. and in following English for and is took place style edited codes news The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"brevity. and in following English for and is took place style edited codes news The\"", "correct_output": "The news codes edited style place took is and for English following in and brevity."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "paths? spiritual nation's nonprofits, (NGOs), pulled a disparate organise centers, non-governmental organisations architects and if together to What", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"paths? spiritual nation's nonprofits, (NGOs), pulled a disparate organise centers, non-governmental organisations architects and if together to What\"", "correct_output": "What to together if and architects organisations non-governmental centers, organise disparate a pulled (NGOs), nonprofits, nation's spiritual paths?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "overcome. form Lowe expected and how up, was some of unclear it's offense that manages It's", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"overcome. form Lowe expected and how up, was some of unclear it's offense that manages It's\"", "correct_output": "It's manages that offense it's unclear of some was up, how and expected Lowe form overcome."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "in. base food of we and our thinking what way our That's", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"in. base food of we and our thinking what way our That's\"", "correct_output": "That's our way what thinking our and we of food base in."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "canal. unclear there was: it on divisive of building banks is at camp same are the the the alliance with the seven farms map, both how and Looking", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"canal. unclear there was: it on divisive of building banks is at camp same are the the the alliance with the seven farms map, both how and Looking\"", "correct_output": "Looking and how both map, farms seven the with alliance the the the are same camp at is banks building of divisive on it was: there unclear canal."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "assessed. to level, entities relevant civil promptly must the review and responsibly fiscal and lawyers order laws, situations legislation, to be state related In", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"assessed. to level, entities relevant civil promptly must the review and responsibly fiscal and lawyers order laws, situations legislation, to be state related In\"", "correct_output": "In related state be to legislation, situations laws, order lawyers and fiscal responsibly and review the must promptly civil relevant entities level, to assessed."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "Texans. the small, our hand, about electorate thousand one 425 is too On", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"Texans. the small, our hand, about electorate thousand one 425 is too On\"", "correct_output": "On too is 425 one thousand electorate about hand, our small, the Texans."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "art. the University according research at at State new investors often of bypass the California, and Merced, Contracts to School that And", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"art. the University according research at at State new investors often of bypass the California, and Merced, Contracts to School that And\"", "correct_output": "And that School to Contracts Merced, and California, the bypass of often investors new State at at research according University the art."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "work. you all moving the It’s", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"work. you all moving the It’s\"", "correct_output": "It’s the moving all you work."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "all. months, to the at if measure, took was some effective if not areas, complete it years, it In", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"all. months, to the at if measure, took was some effective if not areas, complete it years, it In\"", "correct_output": "In it years, it complete areas, not if effective some was took measure, if at the to months, all."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "values. for gardens, a increase causing to significant led high in growing demand a bulb This", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"values. for gardens, a increase causing to significant led high in growing demand a bulb This\"", "correct_output": "This bulb a demand growing in high led significant to causing increase a gardens, for values."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "seekers. clear were glance, not that mere keen associates they was but first it At", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"seekers. clear were glance, not that mere keen associates they was but first it At\"", "correct_output": "At it first but was they associates keen mere that not glance, were clear seekers."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "committee. affairs following said developed author introduced are stimulate that provisions to minimum in the This", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"committee. affairs following said developed author introduced are stimulate that provisions to minimum in the This\"", "correct_output": "This the in minimum to provisions that stimulate are introduced author developed said following affairs committee."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "knowns. plainly resolving have and bad to on insist thinking We", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"knowns. plainly resolving have and bad to on insist thinking We\"", "correct_output": "We thinking insist on to bad and have resolving plainly knowns."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "necessities. in and coaches, had other artists, on gaps to of and who attorneys channels physical came plug producers, the dropped Many", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"necessities. in and coaches, had other artists, on gaps to of and who attorneys channels physical came plug producers, the dropped Many\"", "correct_output": "Many dropped the producers, plug came physical channels attorneys who and of to gaps on artists, other had coaches, and in necessities."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "corner. this also flower understand design the who see from took what I Those", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"corner. this also flower understand design the who see from took what I Those\"", "correct_output": "Those I what took from see who the design understand flower also this corner."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "help. the of of possibilities view, benefit campus local full Chicago from to have people is historically who excluded been the his world In", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"help. the of of possibilities view, benefit campus local full Chicago from to have people is historically who excluded been the his world In\"", "correct_output": "In world his the been excluded who historically is people have to from Chicago full local campus benefit view, possibilities of of the help."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "focus. based of to be his escalation had on functions All", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"focus. based of to be his escalation had on functions All\"", "correct_output": "All functions on had escalation his be to of based focus."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "potential. professor, a he allowed semester those per the five individual assigns busy lessons staffers display their to As", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"potential. professor, a he allowed semester those per the five individual assigns busy lessons staffers display their to As\"", "correct_output": "As to their display staffers lessons busy assigns individual five the per those semester allowed he a professor, potential."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "offense. us and follow through it send its anonymous then to we try accusations, They", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"offense. us and follow through it send its anonymous then to we try accusations, They\"", "correct_output": "They accusations, try we to then anonymous its send it through follow and us offense."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "legislation. toy risk is with this in the the take, of big too you for wake systemic rather especially than a of feel rules extra engaging to the Going", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"legislation. toy risk is with this in the the take, of big too you for wake systemic rather especially than a of feel rules extra engaging to the Going\"", "correct_output": "Going the to engaging extra rules feel of a than especially rather systemic wake for you too big of take, the the in this with is risk toy legislation."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "accounts. podcasts, our elevating about on are but worrying about to rant than elements focus fun rather audience DIY keen we spirited People", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"accounts. podcasts, our elevating about on are but worrying about to rant than elements focus fun rather audience DIY keen we spirited People\"", "correct_output": "People spirited we keen DIY audience rather fun focus elements than rant to about worrying but are on about elevating our podcasts, accounts."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "1997. and billion goods exchange from USD central in USD billion grew 1.0 to in Africa Asia 1989 between 0.6 The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"1997. and billion goods exchange from USD central in USD billion grew 1.0 to in Africa Asia 1989 between 0.6 The\"", "correct_output": "The 0.6 between 1989 Asia Africa in to 1.0 grew billion USD in central USD from exchange goods billion and 1997."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "abound. day it this the start the planted kingdom's that with of day the tomatoes said is green only coincide months, but only on does Not", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"abound. day it this the start the planted kingdom's that with of day the tomatoes said is green only coincide months, but only on does Not\"", "correct_output": "Not does on only but months, coincide only green is said tomatoes the day of with that kingdom's planted the start the this it day abound."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "Anchorage? for hopes your progressive force are in discussion the What", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"Anchorage? for hopes your progressive force are in discussion the What\"", "correct_output": "What the discussion in are force progressive your hopes for Anchorage?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "component. differential our between noisy yields only is The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"component. differential our between noisy yields only is The\"", "correct_output": "The is only yields noisy between our differential component."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "Fisheries. in the of just not is industries, number this of quiet in over Ministry a It", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"Fisheries. in the of just not is industries, number this of quiet in over Ministry a It\"", "correct_output": "It a Ministry over in quiet of this number industries, is not just of the in Fisheries."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "un-branded. (MPAs) the Protected by the through sanctuaries wildlife are Areas national are and while parks Department department, Fisheries managed Marine", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"un-branded. (MPAs) the Protected by the through sanctuaries wildlife are Areas national are and while parks Department department, Fisheries managed Marine\"", "correct_output": "Marine managed Fisheries department, Department parks while and are national Areas are wildlife sanctuaries through the by Protected the (MPAs) un-branded."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "shows. is one one there even the and is title of only who is stated openly that said of the his door: guy it He", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"shows. is one one there even the and is title of only who is stated openly that said of the his door: guy it He\"", "correct_output": "He it guy door: his the of said that openly stated is who only of title is and the even there one one is shows."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "action. to are about demonstrate the have collaborate hope everchanging to with we as and promote, trends we makers We", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"action. to are about demonstrate the have collaborate hope everchanging to with we as and promote, trends we makers We\"", "correct_output": "We makers we trends promote, and as we with to everchanging hope collaborate have the demonstrate about are to action."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "daily. governance been word, a has frustrating In", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"daily. governance been word, a has frustrating In\"", "correct_output": "In frustrating has a word, been governance daily."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "held. and regrets be did we ran for know what no had he not office, practically would When", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"held. and regrets be did we ran for know what no had he not office, practically would When\"", "correct_output": "When would practically office, not he had no what know for ran we did be regrets and held."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "inertia. its does own to appear the press however, date, have not To", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"inertia. its does own to appear the press however, date, have not To\"", "correct_output": "To not have date, however, press the appear to own does its inertia."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "classrooms. the child marches in a printed as she rests headscarf into A", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"classrooms. the child marches in a printed as she rests headscarf into A\"", "correct_output": "A into headscarf rests she as printed a in marches child the classrooms."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "item. through hundreds remember the single of of trails, don't hike plains the pioneer seeing media the we a we miles Across", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"item. through hundreds remember the single of of trails, don't hike plains the pioneer seeing media the we a we miles Across\"", "correct_output": "Across miles we a we the media seeing pioneer the plains hike don't trails, of of single the remember hundreds through item."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "cleaning. annual in Wood and Park the installing all trimmed needed boosting waste contrast, Town solar panels by In", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"cleaning. annual in Wood and Park the installing all trimmed needed boosting waste contrast, Town solar panels by In\"", "correct_output": "In by panels solar Town contrast, waste boosting needed trimmed all installing the Park and Wood in annual cleaning."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "technology. uphill real fully to welcoming is through exercise reach a she an will battle unfold and it predicts it naturally Toronto, Although", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"technology. uphill real fully to welcoming is through exercise reach a she an will battle unfold and it predicts it naturally Toronto, Although\"", "correct_output": "Although Toronto, naturally it predicts it and unfold battle will an she a reach exercise through is welcoming to fully real uphill technology."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "America. the Cape before one zone Hope, travels of Good across the to Ocean Indian Ocean, leg the mainland hiking of last the Atlantic to South Kate", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"America. the Cape before one zone Hope, travels of Good across the to Ocean Indian Ocean, leg the mainland hiking of last the Atlantic to South Kate\"", "correct_output": "Kate South to Atlantic the last of hiking mainland the leg Ocean, Indian Ocean to the across Good of travels Hope, zone one before Cape the America."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "stuff. laundry is of trading but cashflow tax sheet a Transitional", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"stuff. laundry is of trading but cashflow tax sheet a Transitional\"", "correct_output": "Transitional a sheet tax cashflow but trading of is laundry stuff."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "teacher. Education degree, went the became she with become 1976 resist a recognition clerk and her to famous Mia in of instead when a crowd chose Spanish to of Bachelor and and on students, graduated peers most Therefore,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"teacher. Education degree, went the became she with become 1976 resist a recognition clerk and her to famous Mia in of instead when a crowd chose Spanish to of Bachelor and and on students, graduated peers most Therefore,\"", "correct_output": "Therefore, most peers graduated students, on and and Bachelor of to Spanish chose crowd a when instead of in Mia famous to her and clerk recognition a resist 1976 become with she became the went degree, Education teacher."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "aid? the and improvements, aside U.S. themes similar partnership, for labour set does Why", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"aid? the and improvements, aside U.S. themes similar partnership, for labour set does Why\"", "correct_output": "Why does set labour for partnership, similar themes U.S. aside improvements, and the aid?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "entertainment. to to healthcare, aspects and its credited like inspections, re-government cluster analytics, sustained success shape solutions into languages youth be can population-ready of ability The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"entertainment. to to healthcare, aspects and its credited like inspections, re-government cluster analytics, sustained success shape solutions into languages youth be can population-ready of ability The\"", "correct_output": "The ability of population-ready can be youth languages into solutions shape success sustained analytics, cluster re-government inspections, like credited its and aspects healthcare, to to entertainment."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "fundraising. healthy evenings, participation tours, gatherings, comedy with children's practices, performance cultivate to and creative holidays, cooperative exhibits, such as and and intend recreational also socializing and meetings and Many", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"fundraising. healthy evenings, participation tours, gatherings, comedy with children's practices, performance cultivate to and creative holidays, cooperative exhibits, such as and and intend recreational also socializing and meetings and Many\"", "correct_output": "Many and meetings and socializing also recreational intend and and as such exhibits, cooperative holidays, creative and to cultivate performance practices, children's with comedy gatherings, tours, participation evenings, healthy fundraising."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "rally. kind that strength get to that see sad from is we of It", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"rally. kind that strength get to that see sad from is we of It\"", "correct_output": "It of we is from sad see that to get strength that kind rally."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "States. when Russia, Baltic in Poland over hosted past two space and and we openly, Western by Asia, developmental studying from the years, have been groups cultural the Moreover,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"States. when Russia, Baltic in Poland over hosted past two space and and we openly, Western by Asia, developmental studying from the years, have been groups cultural the Moreover,\"", "correct_output": "Moreover, the cultural groups been have years, the from studying developmental Asia, by Western openly, we and and space two past hosted over Poland in Baltic Russia, when States."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "measurement. inverted, this hit for medal quotas a funding then was mandatory of it making definition to The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"measurement. inverted, this hit for medal quotas a funding then was mandatory of it making definition to The\"", "correct_output": "The to definition making it of mandatory was then funding a quotas medal for hit this inverted, measurement."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "was. to wanted to true captain, be as much who she wanted also a to she Kay live As", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"was. to wanted to true captain, be as much who she wanted also a to she Kay live As\"", "correct_output": "As live Kay she to a also wanted she who much as be captain, true to wanted to was."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "engagement. did arena, the regretted passion she nor talented her in waver never for tireless her Mom", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"engagement. did arena, the regretted passion she nor talented her in waver never for tireless her Mom\"", "correct_output": "Mom her tireless for never waver in her talented nor she passion regretted the arena, did engagement."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "logo. legislation its form conclusive of union and under most did common The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"logo. legislation its form conclusive of union and under most did common The\"", "correct_output": "The common did most under and union of conclusive form its legislation logo."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "another. maintained all centuries, with these one a for standoff competing ships those Miraculously,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"another. maintained all centuries, with these one a for standoff competing ships those Miraculously,\"", "correct_output": "Miraculously, those ships competing standoff for a one these with centuries, all maintained another."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "it. the intelligence a features, on new it other excludes the this who our affects behind in stands not aware IT as but because efficiency one resource, from it hand, mind hand, is On", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"it. the intelligence a features, on new it other excludes the this who our affects behind in stands not aware IT as but because efficiency one resource, from it hand, mind hand, is On\"", "correct_output": "On is hand, mind hand, it from resource, one efficiency because but as IT aware not stands in behind affects our who this the excludes other it new on features, a intelligence the it."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "recycling. to the and structural of secure intention mountaineering to cycle, its sports faces difficulty lead due its money lack despite backing improved Nepal,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"recycling. to the and structural of secure intention mountaineering to cycle, its sports faces difficulty lead due its money lack despite backing improved Nepal,\"", "correct_output": "Nepal, improved backing despite lack money its due lead difficulty faces sports its cycle, to mountaineering intention secure of structural and the to recycling."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "sketches. taxes withdraw another make you in context, to up need To", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"sketches. taxes withdraw another make you in context, to up need To\"", "correct_output": "To need up to context, in you make another withdraw taxes sketches."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "happening. art should of times be tumult, In", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"happening. art should of times be tumult, In\"", "correct_output": "In tumult, be times of should art happening."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "deplorable. at is enterprise depot often situation the The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"deplorable. at is enterprise depot often situation the The\"", "correct_output": "The the situation often depot enterprise is at deplorable."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "part. the communion, continue smaller of the Catholic Circus capital Conception, parishes across place biggest at the sits of takes eastern at Roman the which Presbyterian at end the north the closest Cathedral particular of the Immaculate the While", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"part. the communion, continue smaller of the Catholic Circus capital Conception, parishes across place biggest at the sits of takes eastern at Roman the which Presbyterian at end the north the closest Cathedral particular of the Immaculate the While\"", "correct_output": "While the Immaculate the of particular Cathedral closest the north the end at Presbyterian which the Roman at eastern takes of sits the at biggest place across parishes Conception, capital Circus Catholic the of smaller continue communion, the part."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "abroad. memories Turks, — walks — life intend with take there all that to those signs participation of especially school from are Clearly,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"abroad. memories Turks, — walks — life intend with take there all that to those signs participation of especially school from are Clearly,\"", "correct_output": "Clearly, are from school especially of participation signs those to that all there take with intend life — walks — Turks, memories abroad."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "frustration. networks, interpretations Fusion, to to of magical wish which Global secret peace registration try own the into some us at practices via Here", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"frustration. networks, interpretations Fusion, to to of magical wish which Global secret peace registration try own the into some us at practices via Here\"", "correct_output": "Here via practices at us some into the own try registration peace secret Global which wish magical of to to Fusion, interpretations networks, frustration."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "mountaineers. world in top a making highest Japan, ten the mountain destination located it coveted of the are in peaks for Eight", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"mountaineers. world in top a making highest Japan, ten the mountain destination located it coveted of the are in peaks for Eight\"", "correct_output": "Eight for peaks in are the of coveted it located destination mountain the ten Japan, highest making a top in world mountaineers."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "rumour. to networking and the solicitor on rely appeared heard witness The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"rumour. to networking and the solicitor on rely appeared heard witness The\"", "correct_output": "The witness heard appeared rely on solicitor the and networking to rumour."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "ultimately. of had to the veterans leave the participation youth convent of Some", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"ultimately. of had to the veterans leave the participation youth convent of Some\"", "correct_output": "Some of convent youth participation the leave veterans the to had of ultimately."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "oars. like also a lifts, are shortage patients, divers, and clubs, facing risky of machinery We", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"oars. like also a lifts, are shortage patients, divers, and clubs, facing risky of machinery We\"", "correct_output": "We machinery of risky facing clubs, and divers, patients, shortage are lifts, a also like oars."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "factors. relegated all was might inconsistent with global responsibility efforts, to rebuilding fragment which for Top", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"factors. relegated all was might inconsistent with global responsibility efforts, to rebuilding fragment which for Top\"", "correct_output": "Top for which fragment rebuilding to efforts, responsibility global with inconsistent might was all relegated factors."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "locations. followed other Canada Pew the readers and by of judging Tajikistan, are by interviews, readers, USA, its and in Africa Most", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"locations. followed other Canada Pew the readers and by of judging Tajikistan, are by interviews, readers, USA, its and in Africa Most\"", "correct_output": "Most Africa in and its USA, readers, interviews, by are Tajikistan, judging of by and readers the Pew Canada other followed locations."}
