{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Yet with there be also another may sons, letter.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Yet with there be also another may sons, letter.\"", "correct_output": "letter. sons, may another also be there with Yet"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "To this we other day, continue to invoke ecosystems.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"To this we other day, continue to invoke ecosystems.\"", "correct_output": "ecosystems. invoke to continue day, other we this To"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "True, not was totally he pleased with the paintings.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"True, not was totally he pleased with the paintings.\"", "correct_output": "paintings. the with pleased he totally was not True,"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "I make it some has guess shot, may their own and everyone splash.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"I make it some has guess shot, may their own and everyone splash.\"", "correct_output": "splash. everyone and own their may shot, guess has some it make I"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "I give not for will up just a dancer.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"I give not for will up just a dancer.\"", "correct_output": "dancer. a just up will for not give I"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Most below patrons our of urban are locals 17.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Most below patrons our of urban are locals 17.\"", "correct_output": "17. locals are urban of our patrons below Most"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "It to would take it few a get the times other just into phone.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"It to would take it few a get the times other just into phone.\"", "correct_output": "phone. into just other times the get a few it take would to It"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Sure, so be read, some if don't it.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Sure, so be read, some if don't it.\"", "correct_output": "it. don't if some read, be so Sure,"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Sorry, our to writes Annathon Copyright Users.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Sorry, our to writes Annathon Copyright Users.\"", "correct_output": "Users. Copyright Annathon writes to our Sorry,"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Because this, for have padding of first citation posts servers.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Because this, for have padding of first citation posts servers.\"", "correct_output": "servers. posts citation first of padding have for this, Because"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "The has not ties beautiful does political party; own her each any patron salon have to doing.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"The has not ties beautiful does political party; own her each any patron salon have to doing.\"", "correct_output": "doing. to have salon patron any each her own party; political does beautiful ties not has The"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Otherwise, missions too debt on oriented all to is tomorrow.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Otherwise, missions too debt on oriented all to is tomorrow.\"", "correct_output": "tomorrow. is to all oriented on debt too missions Otherwise,"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "I laws of a are allow lot to nice there think parole.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"I laws of a are allow lot to nice there think parole.\"", "correct_output": "parole. think there nice to lot allow are a of laws I"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "This is I as announce to it wanted why nonbroken.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"This is I as announce to it wanted why nonbroken.\"", "correct_output": "nonbroken. why wanted it to announce as I is This"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Society discrete into with exclusive is pieces divided projects.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Society discrete into with exclusive is pieces divided projects.\"", "correct_output": "projects. divided pieces is exclusive with into discrete Society"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Are their jungle of dogs a yet climbing own?", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Are their jungle of dogs a yet climbing own?\"", "correct_output": "own? climbing yet a dogs of jungle their Are"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Meanwhile, gain first fidelity poets whom positive we influence that in his no it is game.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Meanwhile, gain first fidelity poets whom positive we influence that in his no it is game.\"", "correct_output": "game. is it no his in that influence we positive whom poets fidelity first gain Meanwhile,"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "I when was had trouble Philippines 26 the no came and to I following.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"I when was had trouble Philippines 26 the no came and to I following.\"", "correct_output": "following. I to and came no the 26 Philippines trouble had was when I"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Perhaps, was symmetry, its fate wandering lack of not to due isolated.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Perhaps, was symmetry, its fate wandering lack of not to due isolated.\"", "correct_output": "isolated. due to not of lack wandering fate its symmetry, was Perhaps,"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Instead, freedom expression be both right and valued of of must online the offline.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Instead, freedom expression be both right and valued of of must online the offline.\"", "correct_output": "offline. the online must of of valued and right both be expression freedom Instead,"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "That is very and new DC for a a distinction great classification.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"That is very and new DC for a a distinction great classification.\"", "correct_output": "classification. great distinction a a for DC new and very is That"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "An was expected the governmental on Twitter read proclamation account.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"An was expected the governmental on Twitter read proclamation account.\"", "correct_output": "account. proclamation read Twitter on governmental the expected was An"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "It point a for does not reflect modification fee time indication.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"It point a for does not reflect modification fee time indication.\"", "correct_output": "indication. time fee modification reflect not does for a point It"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "I can already at exact only the the is it but speculate number, in target.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"I can already at exact only the the is it but speculate number, in target.\"", "correct_output": "target. in number, speculate but it is the the only exact at already can I"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "What Orwell when self-funded to mind doing you imagine comes charity?", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"What Orwell when self-funded to mind doing you imagine comes charity?\"", "correct_output": "charity? comes imagine you doing mind to self-funded when Orwell What"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "This of was declining the by its studies fascinated football wine.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"This of was declining the by its studies fascinated football wine.\"", "correct_output": "wine. football fascinated studies its by the declining was of This"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Almost region, the 48 with Turkish into operate Asian million over Turkey 4,400 in Central companies the USD invested having nations.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Almost region, the 48 with Turkish into operate Asian million over Turkey 4,400 in Central companies the USD invested having nations.\"", "correct_output": "nations. having invested USD the companies Central in 4,400 Turkey over million Asian operate into Turkish with 48 the region, Almost"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Are the major for operators wider planning update?", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Are the major for operators wider planning update?\"", "correct_output": "update? planning wider operators for major the Are"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Peace foreign and sides manage between policy Asia Turkey to both has major steadily central gaining, been allowing details.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Peace foreign and sides manage between policy Asia Turkey to both has major steadily central gaining, been allowing details.\"", "correct_output": "details. allowing been gaining, central steadily major has both to Turkey Asia policy between manage sides and foreign Peace"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Overall, been inability the specifically known transferred; denied job an to the numerous got account it not least that record one investigating at describe that is does projects have from to due interact.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Overall, been inability the specifically known transferred; denied job an to the numerous got account it not least that record one investigating at describe that is does projects have from to due interact.\"", "correct_output": "interact. due to from have projects does is that describe at investigating one record that least not it account got numerous the to an job denied transferred; known specifically the inability been Overall,"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Discussions of the then design, revolved forestry, around for enhanced advertising welfare and sponsors.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Discussions of the then design, revolved forestry, around for enhanced advertising welfare and sponsors.\"", "correct_output": "sponsors. and welfare advertising enhanced for around forestry, revolved design, then the of Discussions"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Our US the State appeared the recent UK environmental has Department, three the publication in and of journal organizations.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Our US the State appeared the recent UK environmental has Department, three the publication in and of journal organizations.\"", "correct_output": "organizations. journal of and in publication the three Department, has environmental UK recent the appeared State the US Our"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "What it also in what a mean fall while does love out seeing working it it label to with is?", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"What it also in what a mean fall while does love out seeing working it it label to with is?\"", "correct_output": "is? with to label it it working seeing out love does while fall mean a what in also it What"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Among in hunting is areas which of less which disc stores and in the world favour?", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Among in hunting is areas which of less which disc stores and in the world favour?\"", "correct_output": "favour? world the in and stores disc which less of which areas is hunting in Among"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "As he a on directory, of and counselor, got a was initiative, a created stakes University and a dictionary person and newspapers interviews.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"As he a on directory, of and counselor, got a was initiative, a created stakes University and a dictionary person and newspapers interviews.\"", "correct_output": "interviews. newspapers and person dictionary a and University stakes created a initiative, was a got counselor, and of directory, on a he As"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "He a but how didn't defense might request like club we debate, starts.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"He a but how didn't defense might request like club we debate, starts.\"", "correct_output": "starts. debate, we club like request might defense didn't how but a He"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "The news codes edited style place took is and for English following in and brevity.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"The news codes edited style place took is and for English following in and brevity.\"", "correct_output": "brevity. and in following English for and is took place style edited codes news The"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "What to together if and architects organisations non-governmental centers, organise disparate a pulled (NGOs), nonprofits, nation's spiritual paths?", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"What to together if and architects organisations non-governmental centers, organise disparate a pulled (NGOs), nonprofits, nation's spiritual paths?\"", "correct_output": "paths? spiritual nation's nonprofits, (NGOs), pulled a disparate organise centers, non-governmental organisations architects and if together to What"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "It's manages that offense it's unclear of some was up, how and expected Lowe form overcome.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"It's manages that offense it's unclear of some was up, how and expected Lowe form overcome.\"", "correct_output": "overcome. form Lowe expected and how up, was some of unclear it's offense that manages It's"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "That's our way what thinking our and we of food base in.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"That's our way what thinking our and we of food base in.\"", "correct_output": "in. base food of we and our thinking what way our That's"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Looking and how both map, farms seven the with alliance the the the are same camp at is banks building of divisive on it was: there unclear canal.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Looking and how both map, farms seven the with alliance the the the are same camp at is banks building of divisive on it was: there unclear canal.\"", "correct_output": "canal. unclear there was: it on divisive of building banks is at camp same are the the the alliance with the seven farms map, both how and Looking"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "In related state be to legislation, situations laws, order lawyers and fiscal responsibly and review the must promptly civil relevant entities level, to assessed.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"In related state be to legislation, situations laws, order lawyers and fiscal responsibly and review the must promptly civil relevant entities level, to assessed.\"", "correct_output": "assessed. to level, entities relevant civil promptly must the review and responsibly fiscal and lawyers order laws, situations legislation, to be state related In"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "On too is 425 one thousand electorate about hand, our small, the Texans.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"On too is 425 one thousand electorate about hand, our small, the Texans.\"", "correct_output": "Texans. the small, our hand, about electorate thousand one 425 is too On"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "And that School to Contracts Merced, and California, the bypass of often investors new State at at research according University the art.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"And that School to Contracts Merced, and California, the bypass of often investors new State at at research according University the art.\"", "correct_output": "art. the University according research at at State new investors often of bypass the California, and Merced, Contracts to School that And"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "It’s the moving all you work.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"It’s the moving all you work.\"", "correct_output": "work. you all moving the It’s"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "In it years, it complete areas, not if effective some was took measure, if at the to months, all.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"In it years, it complete areas, not if effective some was took measure, if at the to months, all.\"", "correct_output": "all. months, to the at if measure, took was some effective if not areas, complete it years, it In"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "This bulb a demand growing in high led significant to causing increase a gardens, for values.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"This bulb a demand growing in high led significant to causing increase a gardens, for values.\"", "correct_output": "values. for gardens, a increase causing to significant led high in growing demand a bulb This"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "At it first but was they associates keen mere that not glance, were clear seekers.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"At it first but was they associates keen mere that not glance, were clear seekers.\"", "correct_output": "seekers. clear were glance, not that mere keen associates they was but first it At"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "This the in minimum to provisions that stimulate are introduced author developed said following affairs committee.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"This the in minimum to provisions that stimulate are introduced author developed said following affairs committee.\"", "correct_output": "committee. affairs following said developed author introduced are stimulate that provisions to minimum in the This"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "We thinking insist on to bad and have resolving plainly knowns.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"We thinking insist on to bad and have resolving plainly knowns.\"", "correct_output": "knowns. plainly resolving have and bad to on insist thinking We"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Many dropped the producers, plug came physical channels attorneys who and of to gaps on artists, other had coaches, and in necessities.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Many dropped the producers, plug came physical channels attorneys who and of to gaps on artists, other had coaches, and in necessities.\"", "correct_output": "necessities. in and coaches, had other artists, on gaps to of and who attorneys channels physical came plug producers, the dropped Many"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Those I what took from see who the design understand flower also this corner.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Those I what took from see who the design understand flower also this corner.\"", "correct_output": "corner. this also flower understand design the who see from took what I Those"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "In world his the been excluded who historically is people have to from Chicago full local campus benefit view, possibilities of of the help.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"In world his the been excluded who historically is people have to from Chicago full local campus benefit view, possibilities of of the help.\"", "correct_output": "help. the of of possibilities view, benefit campus local full Chicago from to have people is historically who excluded been the his world In"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "All functions on had escalation his be to of based focus.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"All functions on had escalation his be to of based focus.\"", "correct_output": "focus. based of to be his escalation had on functions All"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "As to their display staffers lessons busy assigns individual five the per those semester allowed he a professor, potential.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"As to their display staffers lessons busy assigns individual five the per those semester allowed he a professor, potential.\"", "correct_output": "potential. professor, a he allowed semester those per the five individual assigns busy lessons staffers display their to As"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "They accusations, try we to then anonymous its send it through follow and us offense.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"They accusations, try we to then anonymous its send it through follow and us offense.\"", "correct_output": "offense. us and follow through it send its anonymous then to we try accusations, They"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Going the to engaging extra rules feel of a than especially rather systemic wake for you too big of take, the the in this with is risk toy legislation.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Going the to engaging extra rules feel of a than especially rather systemic wake for you too big of take, the the in this with is risk toy legislation.\"", "correct_output": "legislation. toy risk is with this in the the take, of big too you for wake systemic rather especially than a of feel rules extra engaging to the Going"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "People spirited we keen DIY audience rather fun focus elements than rant to about worrying but are on about elevating our podcasts, accounts.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"People spirited we keen DIY audience rather fun focus elements than rant to about worrying but are on about elevating our podcasts, accounts.\"", "correct_output": "accounts. podcasts, our elevating about on are but worrying about to rant than elements focus fun rather audience DIY keen we spirited People"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "The 0.6 between 1989 Asia Africa in to 1.0 grew billion USD in central USD from exchange goods billion and 1997.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"The 0.6 between 1989 Asia Africa in to 1.0 grew billion USD in central USD from exchange goods billion and 1997.\"", "correct_output": "1997. and billion goods exchange from USD central in USD billion grew 1.0 to in Africa Asia 1989 between 0.6 The"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Not does on only but months, coincide only green is said tomatoes the day of with that kingdom's planted the start the this it day abound.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Not does on only but months, coincide only green is said tomatoes the day of with that kingdom's planted the start the this it day abound.\"", "correct_output": "abound. day it this the start the planted kingdom's that with of day the tomatoes said is green only coincide months, but only on does Not"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "What the discussion in are force progressive your hopes for Anchorage?", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"What the discussion in are force progressive your hopes for Anchorage?\"", "correct_output": "Anchorage? for hopes your progressive force are in discussion the What"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "The is only yields noisy between our differential component.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"The is only yields noisy between our differential component.\"", "correct_output": "component. differential our between noisy yields only is The"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "It a Ministry over in quiet of this number industries, is not just of the in Fisheries.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"It a Ministry over in quiet of this number industries, is not just of the in Fisheries.\"", "correct_output": "Fisheries. in the of just not is industries, number this of quiet in over Ministry a It"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Marine managed Fisheries department, Department parks while and are national Areas are wildlife sanctuaries through the by Protected the (MPAs) un-branded.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Marine managed Fisheries department, Department parks while and are national Areas are wildlife sanctuaries through the by Protected the (MPAs) un-branded.\"", "correct_output": "un-branded. (MPAs) the Protected by the through sanctuaries wildlife are Areas national are and while parks Department department, Fisheries managed Marine"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "He it guy door: his the of said that openly stated is who only of title is and the even there one one is shows.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"He it guy door: his the of said that openly stated is who only of title is and the even there one one is shows.\"", "correct_output": "shows. is one one there even the and is title of only who is stated openly that said of the his door: guy it He"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "We makers we trends promote, and as we with to everchanging hope collaborate have the demonstrate about are to action.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"We makers we trends promote, and as we with to everchanging hope collaborate have the demonstrate about are to action.\"", "correct_output": "action. to are about demonstrate the have collaborate hope everchanging to with we as and promote, trends we makers We"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "In frustrating has a word, been governance daily.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"In frustrating has a word, been governance daily.\"", "correct_output": "daily. governance been word, a has frustrating In"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "When would practically office, not he had no what know for ran we did be regrets and held.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"When would practically office, not he had no what know for ran we did be regrets and held.\"", "correct_output": "held. and regrets be did we ran for know what no had he not office, practically would When"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "To not have date, however, press the appear to own does its inertia.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"To not have date, however, press the appear to own does its inertia.\"", "correct_output": "inertia. its does own to appear the press however, date, have not To"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "A into headscarf rests she as printed a in marches child the classrooms.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"A into headscarf rests she as printed a in marches child the classrooms.\"", "correct_output": "classrooms. the child marches in a printed as she rests headscarf into A"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Across miles we a we the media seeing pioneer the plains hike don't trails, of of single the remember hundreds through item.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Across miles we a we the media seeing pioneer the plains hike don't trails, of of single the remember hundreds through item.\"", "correct_output": "item. through hundreds remember the single of of trails, don't hike plains the pioneer seeing media the we a we miles Across"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "In by panels solar Town contrast, waste boosting needed trimmed all installing the Park and Wood in annual cleaning.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"In by panels solar Town contrast, waste boosting needed trimmed all installing the Park and Wood in annual cleaning.\"", "correct_output": "cleaning. annual in Wood and Park the installing all trimmed needed boosting waste contrast, Town solar panels by In"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Although Toronto, naturally it predicts it and unfold battle will an she a reach exercise through is welcoming to fully real uphill technology.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Although Toronto, naturally it predicts it and unfold battle will an she a reach exercise through is welcoming to fully real uphill technology.\"", "correct_output": "technology. uphill real fully to welcoming is through exercise reach a she an will battle unfold and it predicts it naturally Toronto, Although"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Kate South to Atlantic the last of hiking mainland the leg Ocean, Indian Ocean to the across Good of travels Hope, zone one before Cape the America.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Kate South to Atlantic the last of hiking mainland the leg Ocean, Indian Ocean to the across Good of travels Hope, zone one before Cape the America.\"", "correct_output": "America. the Cape before one zone Hope, travels of Good across the to Ocean Indian Ocean, leg the mainland hiking of last the Atlantic to South Kate"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Transitional a sheet tax cashflow but trading of is laundry stuff.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Transitional a sheet tax cashflow but trading of is laundry stuff.\"", "correct_output": "stuff. laundry is of trading but cashflow tax sheet a Transitional"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Therefore, most peers graduated students, on and and Bachelor of to Spanish chose crowd a when instead of in Mia famous to her and clerk recognition a resist 1976 become with she became the went degree, Education teacher.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Therefore, most peers graduated students, on and and Bachelor of to Spanish chose crowd a when instead of in Mia famous to her and clerk recognition a resist 1976 become with she became the went degree, Education teacher.\"", "correct_output": "teacher. Education degree, went the became she with become 1976 resist a recognition clerk and her to famous Mia in of instead when a crowd chose Spanish to of Bachelor and and on students, graduated peers most Therefore,"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Why does set labour for partnership, similar themes U.S. aside improvements, and the aid?", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Why does set labour for partnership, similar themes U.S. aside improvements, and the aid?\"", "correct_output": "aid? the and improvements, aside U.S. themes similar partnership, for labour set does Why"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "The ability of population-ready can be youth languages into solutions shape success sustained analytics, cluster re-government inspections, like credited its and aspects healthcare, to to entertainment.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"The ability of population-ready can be youth languages into solutions shape success sustained analytics, cluster re-government inspections, like credited its and aspects healthcare, to to entertainment.\"", "correct_output": "entertainment. to to healthcare, aspects and its credited like inspections, re-government cluster analytics, sustained success shape solutions into languages youth be can population-ready of ability The"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Many and meetings and socializing also recreational intend and and as such exhibits, cooperative holidays, creative and to cultivate performance practices, children's with comedy gatherings, tours, participation evenings, healthy fundraising.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Many and meetings and socializing also recreational intend and and as such exhibits, cooperative holidays, creative and to cultivate performance practices, children's with comedy gatherings, tours, participation evenings, healthy fundraising.\"", "correct_output": "fundraising. healthy evenings, participation tours, gatherings, comedy with children's practices, performance cultivate to and creative holidays, cooperative exhibits, such as and and intend recreational also socializing and meetings and Many"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "It of we is from sad see that to get strength that kind rally.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"It of we is from sad see that to get strength that kind rally.\"", "correct_output": "rally. kind that strength get to that see sad from is we of It"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Moreover, the cultural groups been have years, the from studying developmental Asia, by Western openly, we and and space two past hosted over Poland in Baltic Russia, when States.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Moreover, the cultural groups been have years, the from studying developmental Asia, by Western openly, we and and space two past hosted over Poland in Baltic Russia, when States.\"", "correct_output": "States. when Russia, Baltic in Poland over hosted past two space and and we openly, Western by Asia, developmental studying from the years, have been groups cultural the Moreover,"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "The to definition making it of mandatory was then funding a quotas medal for hit this inverted, measurement.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"The to definition making it of mandatory was then funding a quotas medal for hit this inverted, measurement.\"", "correct_output": "measurement. inverted, this hit for medal quotas a funding then was mandatory of it making definition to The"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "As live Kay she to a also wanted she who much as be captain, true to wanted to was.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"As live Kay she to a also wanted she who much as be captain, true to wanted to was.\"", "correct_output": "was. to wanted to true captain, be as much who she wanted also a to she Kay live As"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Mom her tireless for never waver in her talented nor she passion regretted the arena, did engagement.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Mom her tireless for never waver in her talented nor she passion regretted the arena, did engagement.\"", "correct_output": "engagement. did arena, the regretted passion she nor talented her in waver never for tireless her Mom"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "The common did most under and union of conclusive form its legislation logo.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"The common did most under and union of conclusive form its legislation logo.\"", "correct_output": "logo. legislation its form conclusive of union and under most did common The"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Miraculously, those ships competing standoff for a one these with centuries, all maintained another.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Miraculously, those ships competing standoff for a one these with centuries, all maintained another.\"", "correct_output": "another. maintained all centuries, with these one a for standoff competing ships those Miraculously,"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "On is hand, mind hand, it from resource, one efficiency because but as IT aware not stands in behind affects our who this the excludes other it new on features, a intelligence the it.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"On is hand, mind hand, it from resource, one efficiency because but as IT aware not stands in behind affects our who this the excludes other it new on features, a intelligence the it.\"", "correct_output": "it. the intelligence a features, on new it other excludes the this who our affects behind in stands not aware IT as but because efficiency one resource, from it hand, mind hand, is On"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Nepal, improved backing despite lack money its due lead difficulty faces sports its cycle, to mountaineering intention secure of structural and the to recycling.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Nepal, improved backing despite lack money its due lead difficulty faces sports its cycle, to mountaineering intention secure of structural and the to recycling.\"", "correct_output": "recycling. to the and structural of secure intention mountaineering to cycle, its sports faces difficulty lead due its money lack despite backing improved Nepal,"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "To need up to context, in you make another withdraw taxes sketches.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"To need up to context, in you make another withdraw taxes sketches.\"", "correct_output": "sketches. taxes withdraw another make you in context, to up need To"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "In tumult, be times of should art happening.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"In tumult, be times of should art happening.\"", "correct_output": "happening. art should of times be tumult, In"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "The the situation often depot enterprise is at deplorable.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"The the situation often depot enterprise is at deplorable.\"", "correct_output": "deplorable. at is enterprise depot often situation the The"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "While the Immaculate the of particular Cathedral closest the north the end at Presbyterian which the Roman at eastern takes of sits the at biggest place across parishes Conception, capital Circus Catholic the of smaller continue communion, the part.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"While the Immaculate the of particular Cathedral closest the north the end at Presbyterian which the Roman at eastern takes of sits the at biggest place across parishes Conception, capital Circus Catholic the of smaller continue communion, the part.\"", "correct_output": "part. the communion, continue smaller of the Catholic Circus capital Conception, parishes across place biggest at the sits of takes eastern at Roman the which Presbyterian at end the north the closest Cathedral particular of the Immaculate the While"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Clearly, are from school especially of participation signs those to that all there take with intend life — walks — Turks, memories abroad.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Clearly, are from school especially of participation signs those to that all there take with intend life — walks — Turks, memories abroad.\"", "correct_output": "abroad. memories Turks, — walks — life intend with take there all that to those signs participation of especially school from are Clearly,"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Here via practices at us some into the own try registration peace secret Global which wish magical of to to Fusion, interpretations networks, frustration.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Here via practices at us some into the own try registration peace secret Global which wish magical of to to Fusion, interpretations networks, frustration.\"", "correct_output": "frustration. networks, interpretations Fusion, to to of magical wish which Global secret peace registration try own the into some us at practices via Here"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Eight for peaks in are the of coveted it located destination mountain the ten Japan, highest making a top in world mountaineers.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Eight for peaks in are the of coveted it located destination mountain the ten Japan, highest making a top in world mountaineers.\"", "correct_output": "mountaineers. world in top a making highest Japan, ten the mountain destination located it coveted of the are in peaks for Eight"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "The witness heard appeared rely on solicitor the and networking to rumour.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"The witness heard appeared rely on solicitor the and networking to rumour.\"", "correct_output": "rumour. to networking and the solicitor on rely appeared heard witness The"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Some of convent youth participation the leave veterans the to had of ultimately.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Some of convent youth participation the leave veterans the to had of ultimately.\"", "correct_output": "ultimately. of had to the veterans leave the participation youth convent of Some"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "We machinery of risky facing clubs, and divers, patients, shortage are lifts, a also like oars.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"We machinery of risky facing clubs, and divers, patients, shortage are lifts, a also like oars.\"", "correct_output": "oars. like also a lifts, are shortage patients, divers, and clubs, facing risky of machinery We"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Top for which fragment rebuilding to efforts, responsibility global with inconsistent might was all relegated factors.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Top for which fragment rebuilding to efforts, responsibility global with inconsistent might was all relegated factors.\"", "correct_output": "factors. relegated all was might inconsistent with global responsibility efforts, to rebuilding fragment which for Top"}
{"task_name": "reverse_enc", "example_type": "revenc", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"%s\"", "input": "Most Africa in and its USA, readers, interviews, by are Tajikistan, judging of by and readers the Pew Canada other followed locations.", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words they are attached to: \"Most Africa in and its USA, readers, interviews, by are Tajikistan, judging of by and readers the Pew Canada other followed locations.\"", "correct_output": "locations. followed other Canada Pew the readers and by of judging Tajikistan, are by interviews, readers, USA, its and in Africa Most"}
