{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "letter. another be also may there sons, with Yet", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"letter. another be also may there sons, with Yet\"", "correct_output": "Yet with sons, there may also be another letter."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "ecosystems. other invoke to continue we day, this To", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"ecosystems. other invoke to continue we day, this To\"", "correct_output": "To this day, we continue to invoke other ecosystems."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "paintings. the with pleased totally not was he True,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"paintings. the with pleased totally not was he True,\"", "correct_output": "True, he was not totally pleased with the paintings."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "splash. it make may some and shot, own their has everyone guess I", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"splash. it make may some and shot, own their has everyone guess I\"", "correct_output": "I guess everyone has their own shot, and some may make it splash."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "dancer. a for just up give not will I", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"dancer. a for just up give not will I\"", "correct_output": "I will not give up just for a dancer."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "17. below locals urban are patrons our of Most", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"17. below locals urban are patrons our of Most\"", "correct_output": "Most of our patrons are urban locals below 17."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "phone. other the into it get to times few a take just would It", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"phone. other the into it get to times few a take just would It\"", "correct_output": "It would just take a few times to get it into the other phone."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "it. be so read, don't some if Sure,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"it. be so read, don't some if Sure,\"", "correct_output": "Sure, if some don't read, so be it."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "Users. Copyright our to writes Annathon Sorry,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"Users. Copyright our to writes Annathon Sorry,\"", "correct_output": "Sorry, Annathon writes to our Copyright Users."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "servers. citation for padding have posts first this, of Because", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"servers. citation for padding have posts first this, of Because\"", "correct_output": "Because of this, first posts have padding for citation servers."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "doing. beautiful own her has patron each party; political any to ties have not does salon The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"doing. beautiful own her has patron each party; political any to ties have not does salon The\"", "correct_output": "The salon does not have ties to any political party; each patron has her own beautiful doing."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "tomorrow. to missions on oriented too is debt all Otherwise,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"tomorrow. to missions on oriented too is debt all Otherwise,\"", "correct_output": "Otherwise, all debt is too oriented on missions to tomorrow."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "parole. allow to laws nice of lot a are there think I", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"parole. allow to laws nice of lot a are there think I\"", "correct_output": "I think there are a lot of nice laws to allow parole."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "nonbroken. as it announce to wanted I why is This", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"nonbroken. as it announce to wanted I why is This\"", "correct_output": "This is why I wanted to announce it as nonbroken."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "projects. exclusive with pieces discrete into divided is Society", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"projects. exclusive with pieces discrete into divided is Society\"", "correct_output": "Society is divided into discrete pieces with exclusive projects."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "own? their of jungle a climbing yet dogs Are", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"own? their of jungle a climbing yet dogs Are\"", "correct_output": "Are dogs yet climbing a jungle of their own?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "game. his in fidelity no gain influence first we whom poets that positive is it Meanwhile,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"game. his in fidelity no gain influence first we whom poets that positive is it Meanwhile,\"", "correct_output": "Meanwhile, it is positive that poets whom we first influence gain no fidelity in his game."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "following. trouble no had and 26 was I when Philippines the to came I", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"following. trouble no had and 26 was I when Philippines the to came I\"", "correct_output": "I came to the Philippines when I was 26 and had no trouble following."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "isolated. wandering not was fate symmetry, of lack its to due Perhaps,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"isolated. wandering not was fate symmetry, of lack its to due Perhaps,\"", "correct_output": "Perhaps, due to its lack of symmetry, fate was not wandering isolated."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "offline. and online both valued be must expression of freedom of right the Instead,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"offline. and online both valued be must expression of freedom of right the Instead,\"", "correct_output": "Instead, the right of freedom of expression must be valued both online and offline."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "classification. new very a and DC for distinction great a is That", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"classification. new very a and DC for distinction great a is That\"", "correct_output": "That is a great distinction for DC and a very new classification."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "account. Twitter governmental the on read was proclamation expected An", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"account. Twitter governmental the on read was proclamation expected An\"", "correct_output": "An expected proclamation was read on the governmental Twitter account."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "indication. modification fee for point time a reflect not does It", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"indication. modification fee for point time a reflect not does It\"", "correct_output": "It does not reflect a time point for fee modification indication."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "target. the in already is it but number, exact the at speculate only can I", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"target. the in already is it but number, exact the at speculate only can I\"", "correct_output": "I can only speculate at the exact number, but it is already in the target."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "charity? self-funded doing Orwell imagine you when mind to comes What", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"charity? self-funded doing Orwell imagine you when mind to comes What\"", "correct_output": "What comes to mind when you imagine Orwell doing self-funded charity?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "wine. its of studies declining the by fascinated was football This", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"wine. its of studies declining the by fascinated was football This\"", "correct_output": "This football was fascinated by the declining studies of its wine."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "nations. Asian Central the into million 48 USD over invested having Turkey with region, the in operate companies Turkish 4,400 Almost", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"nations. Asian Central the into million 48 USD over invested having Turkey with region, the in operate companies Turkish 4,400 Almost\"", "correct_output": "Almost 4,400 Turkish companies operate in the region, with Turkey having invested over USD 48 million into the Central Asian nations."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "update? wider the for planning operators major Are", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"update? wider the for planning operators major Are\"", "correct_output": "Are major operators planning for the wider update?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "details. policy foreign major manage to sides both allowing gaining, steadily been has Asia central and Turkey between Peace", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"details. policy foreign major manage to sides both allowing gaining, steadily been has Asia central and Turkey between Peace\"", "correct_output": "Peace between Turkey and central Asia has been steadily gaining, allowing both sides to manage major foreign policy details."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "interact. to inability the to due denied got job investigating an from account one least at that known is it transferred; specifically been have that projects numerous describe not does record the Overall,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"interact. to inability the to due denied got job investigating an from account one least at that known is it transferred; specifically been have that projects numerous describe not does record the Overall,\"", "correct_output": "Overall, the record does not describe numerous projects that have been specifically transferred; it is known that at least one account from an investigating job got denied due to the inability to interact."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "sponsors. of welfare the for advertising enhanced and design, forestry, around revolved then Discussions", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"sponsors. of welfare the for advertising enhanced and design, forestry, around revolved then Discussions\"", "correct_output": "Discussions then revolved around forestry, design, and enhanced advertising for the welfare of sponsors."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "organizations. environmental three and UK the Department, State US the of journal recent the in appeared has publication Our", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"organizations. environmental three and UK the Department, State US the of journal recent the in appeared has publication Our\"", "correct_output": "Our publication has appeared in the recent journal of the US State Department, the UK and three environmental organizations."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "is? it what out working it seeing also while label a with love in fall to mean it does What", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"is? it what out working it seeing also while label a with love in fall to mean it does What\"", "correct_output": "What does it mean to fall in love with a label while also seeing it working out what it is?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "favour? in less hunting disc is world the of areas which in and stores which Among", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"favour? in less hunting disc is world the of areas which in and stores which Among\"", "correct_output": "Among which stores and in which areas of the world is disc hunting less in favour?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "interviews. and newspapers on stakes got and directory, a and dictionary a created counselor, University a was he initiative, of person a As", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"interviews. and newspapers on stakes got and directory, a and dictionary a created counselor, University a was he initiative, of person a As\"", "correct_output": "As a person of initiative, he was a University counselor, created a dictionary and a directory, and got stakes on newspapers and interviews."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "starts. defense club a how like didn't we but debate, request might He", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"starts. defense club a how like didn't we but debate, request might He\"", "correct_output": "He might request debate, but we didn't like how a club defense starts."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "brevity. and style for edited is and codes news English in place took following The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"brevity. and style for edited is and codes news English in place took following The\"", "correct_output": "The following took place in English news codes and is edited for style and brevity."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "paths? disparate organise to together pulled architects and nonprofits, centers, spiritual (NGOs), organisations non-governmental nation's a if What", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"paths? disparate organise to together pulled architects and nonprofits, centers, spiritual (NGOs), organisations non-governmental nation's a if What\"", "correct_output": "What if a nation's non-governmental organisations (NGOs), spiritual centers, nonprofits, and architects pulled together to organise disparate paths?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "overcome. was offense of form some that expected it's and up, manages Lowe how unclear It's", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"overcome. was offense of form some that expected it's and up, manages Lowe how unclear It's\"", "correct_output": "It's unclear how Lowe manages up, and it's expected that some form of offense was overcome."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "in. food our base we what and thinking of way our That's", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"in. food our base we what and thinking of way our That's\"", "correct_output": "That's our way of thinking and what we base our food in."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "canal. the of banks both on camp same the with building and farms seven are there was: alliance the divisive how unclear is it map, the at Looking", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"canal. the of banks both on camp same the with building and farms seven are there was: alliance the divisive how unclear is it map, the at Looking\"", "correct_output": "Looking at the map, it is unclear how divisive the alliance was: there are seven farms and building with the same camp on both banks of the canal."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "assessed. promptly be must lawyers civil level, fiscal the and situations related to relevant entities state and legislation, laws, review responsibly to order In", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"assessed. promptly be must lawyers civil level, fiscal the and situations related to relevant entities state and legislation, laws, review responsibly to order In\"", "correct_output": "In order to responsibly review laws, legislation, and state entities relevant to related situations and the fiscal level, civil lawyers must be promptly assessed."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "Texans. thousand 425 about small, too is electorate our hand, one the On", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"Texans. thousand 425 about small, too is electorate our hand, one the On\"", "correct_output": "On the one hand, our electorate is too small, about 425 thousand Texans."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "art. that bypass often investors Merced, California, of University the at School State and Contracts the at research new to according And", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"art. that bypass often investors Merced, California, of University the at School State and Contracts the at research new to according And\"", "correct_output": "And according to new research at the Contracts and State School at the University of California, Merced, investors often bypass that art."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "work. the all moving you It’s", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"work. the all moving you It’s\"", "correct_output": "It’s you moving all the work."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "all. at effective was it if measure, the complete to years, not if months, took it areas, some In", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"all. at effective was it if measure, the complete to years, not if months, took it areas, some In\"", "correct_output": "In some areas, it took months, if not years, to complete the measure, if it was effective at all."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "values. bulb in increase significant a causing gardens, growing for demand high a to led This", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"values. bulb in increase significant a causing gardens, growing for demand high a to led This\"", "correct_output": "This led to a high demand for growing gardens, causing a significant increase in bulb values."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "seekers. keen but associates mere not were they that clear was it glance, first At", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"seekers. keen but associates mere not were they that clear was it glance, first At\"", "correct_output": "At first glance, it was clear that they were not mere associates but keen seekers."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "committee. said in affairs stimulate to developed are that provisions minimum following the introduced author This", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"committee. said in affairs stimulate to developed are that provisions minimum following the introduced author This\"", "correct_output": "This author introduced the following minimum provisions that are developed to stimulate affairs in said committee."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "knowns. bad resolving and plainly thinking on insist to have We", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"knowns. bad resolving and plainly thinking on insist to have We\"", "correct_output": "We have to insist on thinking plainly and resolving bad knowns."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "necessities. physical and channels in gaps other plug to on came dropped had who attorneys and coaches, producers, artists, the of Many", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"necessities. physical and channels in gaps other plug to on came dropped had who attorneys and coaches, producers, artists, the of Many\"", "correct_output": "Many of the artists, producers, coaches, and attorneys who had dropped came on to plug other gaps in channels and physical necessities."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "corner. design this from took I what see also flower the understand who Those", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"corner. design this from took I what see also flower the understand who Those\"", "correct_output": "Those who understand the flower also see what I took from this design corner."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "help. local from excluded been historically have who people of world the benefit to possibilities of full is campus Chicago the view, his In", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"help. local from excluded been historically have who people of world the benefit to possibilities of full is campus Chicago the view, his In\"", "correct_output": "In his view, the Chicago campus is full of possibilities to benefit the world of people who have historically been excluded from local help."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "focus. his on based be to had functions of escalation All", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"focus. his on based be to had functions of escalation All\"", "correct_output": "All escalation of functions had to be based on his focus."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "potential. individual their display to staffers busy those allowed semester per assigns he lessons five the professor, a As", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"potential. individual their display to staffers busy those allowed semester per assigns he lessons five the professor, a As\"", "correct_output": "As a professor, the five lessons he assigns per semester allowed those busy staffers to display their individual potential."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "offense. its through it follow to try we then and accusations, anonymous us send They", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"offense. its through it follow to try we then and accusations, anonymous us send They\"", "correct_output": "They send us anonymous accusations, and then we try to follow it through its offense."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "legislation. systemic this of wake the in especially take, to risk a of big too is feel you rules the with engaging than rather toy extra the for Going", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"legislation. systemic this of wake the in especially take, to risk a of big too is feel you rules the with engaging than rather toy extra the for Going\"", "correct_output": "Going for the extra toy rather than engaging with the rules you feel is too big of a risk to take, especially in the wake of this systemic legislation."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "accounts. spirited about worrying than rather elements fun elevating on audience our focus we but podcasts, DIY about rant to keen are People", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"accounts. spirited about worrying than rather elements fun elevating on audience our focus we but podcasts, DIY about rant to keen are People\"", "correct_output": "People are keen to rant about DIY podcasts, but we focus our audience on elevating fun elements rather than worrying about spirited accounts."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "1997. in billion 0.6 USD to 1989 in billion 1.0 USD from grew Asia central and Africa between exchange goods The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"1997. in billion 0.6 USD to 1989 in billion 1.0 USD from grew Asia central and Africa between exchange goods The\"", "correct_output": "The goods exchange between Africa and central Asia grew from USD 1.0 billion in 1989 to USD 0.6 billion in 1997."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "abound. only day this on planted tomatoes that said is it but months, green kingdom's the of start the with coincide day the does only Not", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"abound. only day this on planted tomatoes that said is it but months, green kingdom's the of start the with coincide day the does only Not\"", "correct_output": "Not only does the day coincide with the start of the kingdom's green months, but it is said that tomatoes planted on this day only abound."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "Anchorage? in force discussion progressive the for hopes your are What", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"Anchorage? in force discussion progressive the for hopes your are What\"", "correct_output": "What are your hopes for the progressive discussion force in Anchorage?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "component. only our is yields noisy between differential The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"component. only our is yields noisy between differential The\"", "correct_output": "The differential between noisy yields is our only component."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "Fisheries. of Ministry the in just not industries, of number a in this over quiet is It", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"Fisheries. of Ministry the in just not industries, of number a in this over quiet is It\"", "correct_output": "It is quiet over this in a number of industries, not just in the Ministry of Fisheries."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "un-branded. are sanctuaries wildlife and parks national while department, Fisheries the through Department the by managed are (MPAs) Areas Protected Marine", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"un-branded. are sanctuaries wildlife and parks national while department, Fisheries the through Department the by managed are (MPAs) Areas Protected Marine\"", "correct_output": "Marine Protected Areas (MPAs) are managed by the Department through the Fisheries department, while national parks and wildlife sanctuaries are un-branded."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "shows. his of one of title the even is it door: one only is there stated and that said openly who guy the is He", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"shows. his of one of title the even is it door: one only is there stated and that said openly who guy the is He\"", "correct_output": "He is the guy who openly said that and stated there is only one door: it is even the title of one of his shows."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "action. demonstrate and makers with collaborate to hope we as promote, to have we trends the about everchanging are We", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"action. demonstrate and makers with collaborate to hope we as promote, to have we trends the about everchanging are We\"", "correct_output": "We are everchanging about the trends we have to promote, as we hope to collaborate with makers and demonstrate action."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "daily. frustrating been has governance word, a In", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"daily. frustrating been has governance word, a In\"", "correct_output": "In a word, governance has been frustrating daily."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "held. be would what know not did practically and regrets no had we office, for ran he When", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"held. be would what know not did practically and regrets no had we office, for ran he When\"", "correct_output": "When he ran for office, we had no regrets and practically did not know what would be held."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "inertia. own its have to appear not does press the however, date, To", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"inertia. own its have to appear not does press the however, date, To\"", "correct_output": "To date, however, the press does not appear to have its own inertia."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "classrooms. the into marches she as rests headscarf printed a in child A", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"classrooms. the into marches she as rests headscarf printed a in child A\"", "correct_output": "A child in a printed headscarf rests as she marches into the classrooms."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "item. media single a seeing remember don't we trails, pioneer the of plains the through hike we miles of hundreds the Across", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"item. media single a seeing remember don't we trails, pioneer the of plains the through hike we miles of hundreds the Across\"", "correct_output": "Across the hundreds of miles we hike through the plains of the pioneer trails, we don't remember seeing a single media item."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "cleaning. needed all boosting and Park Town the in panels solar installing by waste annual trimmed Wood contrast, In", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"cleaning. needed all boosting and Park Town the in panels solar installing by waste annual trimmed Wood contrast, In\"", "correct_output": "In contrast, Wood trimmed annual waste by installing solar panels in the Town Park and boosting all needed cleaning."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "technology. real and exercise through unfold naturally will it predicts she Toronto, welcoming fully a reach to battle uphill an is it Although", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"technology. real and exercise through unfold naturally will it predicts she Toronto, welcoming fully a reach to battle uphill an is it Although\"", "correct_output": "Although it is an uphill battle to reach a fully welcoming Toronto, she predicts it will naturally unfold through exercise and real technology."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "America. South of zone mainland the to Ocean, Atlantic the across leg last one hiking before Hope, Good of Cape the to Ocean Indian the travels Kate", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"America. South of zone mainland the to Ocean, Atlantic the across leg last one hiking before Hope, Good of Cape the to Ocean Indian the travels Kate\"", "correct_output": "Kate travels the Indian Ocean to the Cape of Good Hope, before hiking one last leg across the Atlantic Ocean, to the mainland zone of South America."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "stuff. tax cashflow of sheet laundry a but is trading Transitional", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"stuff. tax cashflow of sheet laundry a but is trading Transitional\"", "correct_output": "Transitional trading is but a laundry sheet of cashflow tax stuff."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "teacher. Spanish and clerk a became instead and crowd recognition the resist to chose she students, famous become to on went peers her of most and degree, Education of Bachelor a with graduated Mia when 1976 in Therefore,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"teacher. Spanish and clerk a became instead and crowd recognition the resist to chose she students, famous become to on went peers her of most and degree, Education of Bachelor a with graduated Mia when 1976 in Therefore,\"", "correct_output": "Therefore, in 1976 when Mia graduated with a Bachelor of Education degree, and most of her peers went on to become famous students, she chose to resist the recognition crowd and instead became a clerk and Spanish teacher."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "aid? labour and partnership, improvements, for themes similar aside set U.S. the does Why", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"aid? labour and partnership, improvements, for themes similar aside set U.S. the does Why\"", "correct_output": "Why does the U.S. set aside similar themes for improvements, partnership, and labour aid?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "entertainment. sustained and languages analytics, healthcare, cluster inspections, like aspects population-ready into solutions youth shape to ability its to credited be can re-government of success The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"entertainment. sustained and languages analytics, healthcare, cluster inspections, like aspects population-ready into solutions youth shape to ability its to credited be can re-government of success The\"", "correct_output": "The success of re-government can be credited to its ability to shape youth solutions into population-ready aspects like inspections, cluster healthcare, analytics, languages and sustained entertainment."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "fundraising. and practices, performance tours, comedy and children's exhibits, cooperative evenings, and meetings holidays, as such gatherings, recreational and creative with participation healthy and socializing cultivate to intend also Many", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"fundraising. and practices, performance tours, comedy and children's exhibits, cooperative evenings, and meetings holidays, as such gatherings, recreational and creative with participation healthy and socializing cultivate to intend also Many\"", "correct_output": "Many also intend to cultivate socializing and healthy participation with creative and recreational gatherings, such as holidays, meetings and evenings, cooperative exhibits, children's and comedy tours, performance practices, and fundraising."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "rally. of kind that from strength get we that see to sad is It", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"rally. of kind that from strength get we that see to sad is It\"", "correct_output": "It is sad to see that we get strength from that kind of rally."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "States. Baltic the and Poland Russia, Asia, Western from space developmental and cultural in groups by hosted been have we openly, studying when years, two past the over Moreover,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"States. Baltic the and Poland Russia, Asia, Western from space developmental and cultural in groups by hosted been have we openly, studying when years, two past the over Moreover,\"", "correct_output": "Moreover, over the past two years, when studying openly, we have been hosted by groups in cultural and developmental space from Western Asia, Russia, Poland and the Baltic States."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "measurement. this hit to quotas funding for mandatory it making inverted, then was medal a of definition The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"measurement. this hit to quotas funding for mandatory it making inverted, then was medal a of definition The\"", "correct_output": "The definition of a medal was then inverted, making it mandatory for funding quotas to hit this measurement."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "was. she who to true live to wanted also she captain, a be to wanted Kay as much As", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"was. she who to true live to wanted also she captain, a be to wanted Kay as much As\"", "correct_output": "As much as Kay wanted to be a captain, she also wanted to live true to who she was."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "engagement. tireless her in waver she did nor arena, talented the for passion her regretted never Mom", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"engagement. tireless her in waver she did nor arena, talented the for passion her regretted never Mom\"", "correct_output": "Mom never regretted her passion for the talented arena, nor did she waver in her tireless engagement."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "logo. its under form did legislation of union conclusive and common most The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"logo. its under form did legislation of union conclusive and common most The\"", "correct_output": "The most common and conclusive union of legislation did form under its logo."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "another. one with standoff a maintained ships competing those centuries, these all for Miraculously,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"another. one with standoff a maintained ships competing those centuries, these all for Miraculously,\"", "correct_output": "Miraculously, for all these centuries, those competing ships maintained a standoff with one another."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "it. behind stands who aware not is it because resource, a as IT in efficiency affects it hand, other the on but features, intelligence new from mind our excludes this hand, one the On", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"it. behind stands who aware not is it because resource, a as IT in efficiency affects it hand, other the on but features, intelligence new from mind our excludes this hand, one the On\"", "correct_output": "On the one hand, this excludes our mind from new intelligence features, but on the other hand, it affects efficiency in IT as a resource, because it is not aware who stands behind it."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "recycling. money improved and backing structural secure of lack its to due difficulty faces cycle, mountaineering sports the lead to intention its despite Nepal,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"recycling. money improved and backing structural secure of lack its to due difficulty faces cycle, mountaineering sports the lead to intention its despite Nepal,\"", "correct_output": "Nepal, despite its intention to lead the sports mountaineering cycle, faces difficulty due to its lack of secure structural backing and improved money recycling."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "sketches. up make to need you context, another in taxes withdraw To", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"sketches. up make to need you context, another in taxes withdraw To\"", "correct_output": "To withdraw taxes in another context, you need to make up sketches."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "happening. be should art tumult, of times In", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"happening. be should art tumult, of times In\"", "correct_output": "In times of tumult, art should be happening."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "deplorable. often is depot enterprise the at situation The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"deplorable. often is depot enterprise the at situation The\"", "correct_output": "The situation at the enterprise depot is often deplorable."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "part. biggest the of north the at Circus Presbyterian of end eastern the at sits which Conception, Immaculate the of Cathedral the at place takes closest the communion, particular the continue capital the across parishes Catholic Roman smaller While", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"part. biggest the of north the at Circus Presbyterian of end eastern the at sits which Conception, Immaculate the of Cathedral the at place takes closest the communion, particular the continue capital the across parishes Catholic Roman smaller While\"", "correct_output": "While smaller Roman Catholic parishes across the capital continue the particular communion, the closest takes place at the Cathedral of the Immaculate Conception, which sits at the eastern end of Presbyterian Circus at the north of the biggest part."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "abroad. participation take to intend — memories school with those especially — life of walks all from Turks, that signs are there Clearly,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"abroad. participation take to intend — memories school with those especially — life of walks all from Turks, that signs are there Clearly,\"", "correct_output": "Clearly, there are signs that Turks, from all walks of life — especially those with school memories — intend to take participation abroad."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "frustration. own to interpretations magical try to wish us of some networks, secret the into registration via peace practices which Fusion, Global at Here", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"frustration. own to interpretations magical try to wish us of some networks, secret the into registration via peace practices which Fusion, Global at Here\"", "correct_output": "Here at Global Fusion, which practices peace via registration into the secret networks, some of us wish to try magical interpretations to own frustration."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "mountaineers. for destination coveted a it making Japan, in located are world the in peaks mountain highest ten top the of Eight", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"mountaineers. for destination coveted a it making Japan, in located are world the in peaks mountain highest ten top the of Eight\"", "correct_output": "Eight of the top ten highest mountain peaks in the world are located in Japan, making it a coveted destination for mountaineers."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "rumour. and networking on rely to appeared heard solicitor the witness The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"rumour. and networking on rely to appeared heard solicitor the witness The\"", "correct_output": "The witness the solicitor heard appeared to rely on networking and rumour."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "ultimately. convent the leave to had participation youth of veterans the of Some", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"ultimately. convent the leave to had participation youth of veterans the of Some\"", "correct_output": "Some of the veterans of youth participation had to leave the convent ultimately."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "oars. like machinery risky also and clubs, lifts, patients, divers, of shortage a facing are We", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"oars. like machinery risky also and clubs, lifts, patients, divers, of shortage a facing are We\"", "correct_output": "We are facing a shortage of divers, patients, lifts, clubs, and also risky machinery like oars."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "factors. inconsistent with fragment might which efforts, all to relegated was rebuilding global for responsibility Top", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"factors. inconsistent with fragment might which efforts, all to relegated was rebuilding global for responsibility Top\"", "correct_output": "Top responsibility for global rebuilding was relegated to all efforts, which might fragment with inconsistent factors."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "locations. other and Africa USA, the by followed Tajikistan, and Canada in readers are interviews, Pew by judging readers, its of Most", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"locations. other and Africa USA, the by followed Tajikistan, and Canada in readers are interviews, Pew by judging readers, its of Most\"", "correct_output": "Most of its readers, judging by Pew interviews, are readers in Canada and Tajikistan, followed by the USA, Africa and other locations."}
