{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "reason. another be also may there time, this But", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"reason. another be also may there time, this But\"", "correct_output": "But this time, there may also be another reason."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "principles. these follow to continue we day, this To", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"principles. these follow to continue we day, this To\"", "correct_output": "To this day, we continue to follow these principles."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "beginning. the from planned exactly not was it Well,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"beginning. the from planned exactly not was it Well,\"", "correct_output": "Well, it was not exactly planned from the beginning."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "happen. it make can they and path, own their has everyone think I", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"happen. it make can they and path, own their has everyone think I\"", "correct_output": "I think everyone has their own path, and they can make it happen."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "moment. a for even up give not will I", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"moment. a for even up give not will I\"", "correct_output": "I will not give up even for a moment."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "45. under people young are readers our of Most", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"45. under people young are readers our of Most\"", "correct_output": "Most of our readers are young people under 45."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "hands. right the into it get to steps few a take just would It", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"hands. right the into it get to steps few a take just would It\"", "correct_output": "It would just take a few steps to get it into the right hands."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "it. be so come, don't they if Well,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"it. be so come, don't they if Well,\"", "correct_output": "Well, if they don't come, so be it."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "story. Instagram her to posted just she First,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"story. Instagram her to posted just she First,\"", "correct_output": "First, she just posted to her Instagram story."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "reasons. security for changed were names their this, of Because", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"reasons. security for changed were names their this, of Because\"", "correct_output": "Because of this, their names were changed for security reasons."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "ideas. political own her has member each party; political any to ties have not does group The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"ideas. political own her has member each party; political any to ties have not does group The\"", "correct_output": "The group does not have ties to any political party; each member has her own political ideas."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "religion. or politics by affected not is work our Hopefully,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"religion. or politics by affected not is work our Hopefully,\"", "correct_output": "Hopefully, our work is not affected by politics or religion."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "change. bring to ways good of lot a are there think I", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"change. bring to ways good of lot a are there think I\"", "correct_output": "I think there are a lot of good ways to bring change."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "women. all to it dedicate to wanted I why is This", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"women. all to it dedicate to wanted I why is This\"", "correct_output": "This is why I wanted to dedicate it to all women."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "opinions. different with groups distinct into divided is Society", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"opinions. different with groups distinct into divided is Society\"", "correct_output": "Society is divided into distinct groups with different opinions."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "own? their of bridge a building now they Are", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"own? their of bridge a building now they Are\"", "correct_output": "Are they now building a bridge of their own?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "work. our in interest an have criticize often we whom those that possible is it Therefore,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"work. our in interest an have criticize often we whom those that possible is it Therefore,\"", "correct_output": "Therefore, it is possible that those whom we often criticize have an interest in our work."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "adjusting. trouble no had and 10 was I when Netherlands the to came I", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"adjusting. trouble no had and 10 was I when Netherlands the to came I\"", "correct_output": "I came to the Netherlands when I was 10 and had no trouble adjusting."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "anywhere. mentioned not was this coverage, of lack the to due However,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"anywhere. mentioned not was this coverage, of lack the to due However,\"", "correct_output": "However, due to the lack of coverage, this was not mentioned anywhere."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "offline. and online both upheld be must expression of freedom to right the Further,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"offline. and online both upheld be must expression of freedom to right the Further,\"", "correct_output": "Further, the right to freedom of expression must be upheld both online and offline."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "responsibility. big very a and us for achievement great a is This", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"responsibility. big very a and us for achievement great a is This\"", "correct_output": "This is a great achievement for us and a very big responsibility."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "account. Twitter presidential the on made was announcement official An", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"account. Twitter presidential the on made was announcement official An\"", "correct_output": "An official announcement was made on the presidential Twitter account."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "procedures. registration the for limit time a specify not does It", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"procedures. registration the for limit time a specify not does It\"", "correct_output": "It does not specify a time limit for the registration procedures."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "dozens. the in already is it but number, exact the on speculate only can I", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"dozens. the in already is it but number, exact the on speculate only can I\"", "correct_output": "I can only speculate on the exact number, but it is already in the dozens."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "science? life-saving doing people imagine you when mind to comes What", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"science? life-saving doing people imagine you when mind to comes What\"", "correct_output": "What comes to mind when you imagine people doing life-saving science?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "time. the of climate political the by influenced was decision This", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"time. the of climate political the by influenced was decision This\"", "correct_output": "This decision was influenced by the political climate of the time."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "economy. Asian Central the into billion 85 USD over invested having Turkey with region, the in operate companies Turkish 4,000 Almost", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"economy. Asian Central the into billion 85 USD over invested having Turkey with region, the in operate companies Turkish 4,000 Almost\"", "correct_output": "Almost 4,000 Turkish companies operate in the region, with Turkey having invested over USD 85 billion into the Central Asian economy."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "demand? large the for prepared countries these Are", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"demand? large the for prepared countries these Are\"", "correct_output": "Are these countries prepared for the large demand?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "agendas. policy foreign their pursue to sides both allowing growing, steadily been has Asia Central and Turkey between Trade", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"agendas. policy foreign their pursue to sides both allowing growing, steadily been has Asia Central and Turkey between Trade\"", "correct_output": "Trade between Turkey and Central Asia has been steadily growing, allowing both sides to pursue their foreign policy agendas."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "register. to inability the to due closed was NGO international an from project one least at that known is it implemented; successfully been have that projects specific indicate not does report the However,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"register. to inability the to due closed was NGO international an from project one least at that known is it implemented; successfully been have that projects specific indicate not does report the However,\"", "correct_output": "However, the report does not indicate specific projects that have been successfully implemented; it is known that at least one project from an international NGO was closed due to the inability to register."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "citizens. of benefit the for development economic and energy, security, around revolved also Discussions", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"citizens. of benefit the for development economic and energy, security, around revolved also Discussions\"", "correct_output": "Discussions also revolved around security, energy, and economic development for the benefit of citizens."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "organizations. international other and UN the Department, State US the of reports annual the in appeared has information Our", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"organizations. international other and UN the Department, State US the of reports annual the in appeared has information Our\"", "correct_output": "Our information has appeared in the annual reports of the US State Department, the UN and other international organizations."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "is? it what for clearly it seeing also while place a with love in fall to mean it does What", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"is? it what for clearly it seeing also while place a with love in fall to mean it does What\"", "correct_output": "What does it mean to fall in love with a place while also seeing it clearly for what it is?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "demand? in most content your is world the of parts which in and groups which Among", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"demand? in most content your is world the of parts which in and groups which Among\"", "correct_output": "Among which groups and in which parts of the world is your content most in demand?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "literature. and journalism in awards won and newspaper, a and university a founded professor, university a was he humanities, of doctor a As", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"literature. and journalism in awards won and newspaper, a and university a founded professor, university a was he humanities, of doctor a As\"", "correct_output": "As a doctor of humanities, he was a university professor, founded a university and a newspaper, and won awards in journalism and literature."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "worked. council city a how know didn't we but things, suggest could We", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"worked. council city a how know didn't we but things, suggest could We\"", "correct_output": "We could suggest things, but we didn't know how a city council worked."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "brevity. and style for edited is and email over English in place took interview The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"brevity. and style for edited is and email over English in place took interview The\"", "correct_output": "The interview took place in English over email and is edited for style and brevity."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "areas? protected conserve to together worked government and businesses, leaders, community (NGOs), organisations non-governmental nation's a if What", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"areas? protected conserve to together worked government and businesses, leaders, community (NGOs), organisations non-governmental nation's a if What\"", "correct_output": "What if a nation's non-governmental organisations (NGOs), community leaders, businesses, and government worked together to conserve protected areas?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "involved. was payment of form some that possible it's but it, managed they how unclear It's", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"involved. was payment of form some that possible it's but it, managed they how unclear It's\"", "correct_output": "It's unclear how they managed it, but it's possible that some form of payment was involved."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "on. work our base we what and thinking of way our That's", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"on. work our base we what and thinking of way our That's\"", "correct_output": "That's our way of thinking and what we base our work on."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "river. the of banks both on name same the with villages and towns still are there was: division the dramatic how evident is it map, the at Looking", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"river. the of banks both on name same the with villages and towns still are there was: division the dramatic how evident is it map, the at Looking\"", "correct_output": "Looking at the map, it is evident how dramatic the division was: there are still towns and villages with the same name on both banks of the river."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "involved. actively be must society civil realm, online the and technology digital to relevant measures other and regulations, laws, design effectively to order In", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"involved. actively be must society civil realm, online the and technology digital to relevant measures other and regulations, laws, design effectively to order In\"", "correct_output": "In order to effectively design laws, regulations, and other measures relevant to digital technology and the online realm, civil society must be actively involved."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "people. thousand 220 about large, not is population the hand, one the On", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"people. thousand 220 about large, not is population the hand, one the On\"", "correct_output": "On the one hand, the population is not large, about 220 thousand people."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "law. this ignore often employers Merced, California, of University the at Center Labor and Community the by research new to according But", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"law. this ignore often employers Merced, California, of University the at Center Labor and Community the by research new to according But\"", "correct_output": "But according to new research by the Community and Labor Center at the University of California, Merced, employers often ignore this law."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "time. the all moving all It’s", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"time. the all moving all It’s\"", "correct_output": "It’s all moving all the time."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "all. at finalized was it if process, the complete to years, not if months, took it cases, some In", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"all. at finalized was it if process, the complete to years, not if months, took it cases, some In\"", "correct_output": "In some cases, it took months, if not years, to complete the process, if it was finalized at all."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "prices. food in increase significant a causing produce, quality for demand high a to led This", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"prices. food in increase significant a causing produce, quality for demand high a to led This\"", "correct_output": "This led to a high demand for quality produce, causing a significant increase in food prices."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "friends. dear but colleagues only not were they that clear was it glance, first At", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"friends. dear but colleagues only not were they that clear was it glance, first At\"", "correct_output": "At first glance, it was clear that they were not only colleagues but dear friends."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "direction. this in success guarantee to necessary are that components crucial following the identifies report This", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"direction. this in success guarantee to necessary are that components crucial following the identifies report This\"", "correct_output": "This report identifies the following crucial components that are necessary to guarantee success in this direction."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "wrongs. the resisting and against speaking on insist to have We", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"wrongs. the resisting and against speaking on insist to have We\"", "correct_output": "We have to insist on speaking against and resisting the wrongs."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "recognition. societal and cultural in gaps these fill to on went marched had who activists and writers, musicians, artists, the of Many", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"recognition. societal and cultural in gaps these fill to on went marched had who activists and writers, musicians, artists, the of Many\"", "correct_output": "Many of the artists, musicians, writers, and activists who had marched went on to fill these gaps in cultural and societal recognition."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "phrase. simple this from mean I what get will region the understand who Those", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"phrase. simple this from mean I what get will region the understand who Those\"", "correct_output": "Those who understand the region will get what I mean from this simple phrase."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "life. civic from excluded been historically have who people of lives the improve to opportunities of full is Valley Central the view, his In", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"life. civic from excluded been historically have who people of lives the improve to opportunities of full is Valley Central the view, his In\"", "correct_output": "In his view, the Central Valley is full of opportunities to improve the lives of people who have historically been excluded from civic life."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "truth. the on based be to has conflicts of resolution The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"truth. the on based be to has conflicts of resolution The\"", "correct_output": "The resolution of conflicts has to be based on the truth."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "potential. leadership their achieve to students same those support semester per teaches he classes five the professor, a As", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"potential. leadership their achieve to students same those support semester per teaches he classes five the professor, a As\"", "correct_output": "As a professor, the five classes he teaches per semester support those same students to achieve their leadership potential."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "sources. our through it verify to try we then and information, anonymous us send They", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"sources. our through it verify to try we then and information, anonymous us send They\"", "correct_output": "They send us anonymous information, and then we try to verify it through our sources."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "uncertainty. dramatic such of face the in especially take, to risk a of big too is know you devil the with sticking than rather guy other the for Going", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"uncertainty. dramatic such of face the in especially take, to risk a of big too is know you devil the with sticking than rather guy other the for Going\"", "correct_output": "Going for the other guy rather than sticking with the devil you know is too big of a risk to take, especially in the face of such dramatic uncertainty."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "comments. negative about worrying than rather projects the elevating on energies our focus we but projects, our about talk to free are People", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"comments. negative about worrying than rather projects the elevating on energies our focus we but projects, our about talk to free are People\"", "correct_output": "People are free to talk about our projects, but we focus our energies on elevating the projects rather than worrying about negative comments."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "2014. in billion 8.6 USD to 2010 in billion 6.5 USD from grew Asia Central and Turkey between turnover trade The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"2014. in billion 8.6 USD to 2010 in billion 6.5 USD from grew Asia Central and Turkey between turnover trade The\"", "correct_output": "The trade turnover between Turkey and Central Asia grew from USD 6.5 billion in 2010 to USD 8.6 billion in 2014."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "thrive. will day this on planted anything that said is it but season, rainy country's the of start the with coincide day the does only Not", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"thrive. will day this on planted anything that said is it but season, rainy country's the of start the with coincide day the does only Not\"", "correct_output": "Not only does the day coincide with the start of the country's rainy season, but it is said that anything planted on this day will thrive."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "Indonesia? in scene filmmaking independent the for hopes your are What", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"Indonesia? in scene filmmaking independent the for hopes your are What\"", "correct_output": "What are your hopes for the independent filmmaking scene in Indonesia?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "challenge. main our is groups these between relationship The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"challenge. main our is groups these between relationship The\"", "correct_output": "The relationship between these groups is our main challenge."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "Education. of Ministry the in just not ministries, of number a in this like still is It", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"Education. of Ministry the in just not ministries, of number a in this like still is It\"", "correct_output": "It is still like this in a number of ministries, not just in the Ministry of Education."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "co-managed. are sanctuaries wildlife and parks national while Department, Fisheries the through government the by managed are (MPAs) Areas Protected Marine", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"co-managed. are sanctuaries wildlife and parks national while Department, Fisheries the through government the by managed are (MPAs) Areas Protected Marine\"", "correct_output": "Marine Protected Areas (MPAs) are managed by the government through the Fisheries Department, while national parks and wildlife sanctuaries are co-managed."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "books. his of one of title the even is it land: one just is there region the that said always who one the is He", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"books. his of one of title the even is it land: one just is there region the that said always who one the is He\"", "correct_output": "He is the one who always said that the region there is just one land: it is even the title of one of his books."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "impact. sustainable for others with collaborate to need we so address, to want we voices the about careful very are We", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"impact. sustainable for others with collaborate to need we so address, to want we voices the about careful very are We\"", "correct_output": "We are very careful about the voices we want to address, so we need to collaborate with others for sustainable impact."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "there. complicated been has everything word, a In", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"there. complicated been has everything word, a In\"", "correct_output": "In a word, everything has been complicated there."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "done. be could what know not did practically and program no had we office, for ran we When", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"done. be could what know not did practically and program no had we office, for ran we When\"", "correct_output": "When we ran for office, we had no program and practically did not know what could be done."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "website. own its have to appear not does brand the however, date, To", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"website. own its have to appear not does brand the however, date, To\"", "correct_output": "To date, however, the brand does not appear to have its own website."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "procession. the with marches she as sings headscarf vibrant a in woman A", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"procession. the with marches she as sings headscarf vibrant a in woman A\"", "correct_output": "A woman in a vibrant headscarf sings as she marches with the procession."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "tent. shade single a seeing remember don't we Valley, Central the of fields the through rode we miles of hundreds the Across", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"tent. shade single a seeing remember don't we Valley, Central the of fields the through rode we miles of hundreds the Across\"", "correct_output": "Across the hundreds of miles we rode through the fields of the Central Valley, we don't remember seeing a single shade tent."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "lighting. street the changing and Hall Town the in panels solar installing by costs energy reduced they addition, In", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"lighting. street the changing and Hall Town the in panels solar installing by costs energy reduced they addition, In\"", "correct_output": "In addition, they reduced energy costs by installing solar panels in the Town Hall and changing the street lighting."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "discussion. open and dialogue through change gradually will it believes she society, inclusive fully a reach to battle uphill an is it Although", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"discussion. open and dialogue through change gradually will it believes she society, inclusive fully a reach to battle uphill an is it Although\"", "correct_output": "Although it is an uphill battle to reach a fully inclusive society, she believes it will gradually change through dialogue and open discussion."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "America. South of part northern the to Ocean, Atlantic the across leg last the making before Hope, Good of Cape the to Ocean Indian the crossed They", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"America. South of part northern the to Ocean, Atlantic the across leg last the making before Hope, Good of Cape the to Ocean Indian the crossed They\"", "correct_output": "They crossed the Indian Ocean to the Cape of Good Hope, before making the last leg across the Atlantic Ocean, to the northern part of South America."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "deeds. bad and good of sheet balance a not is justice Transitional", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"deeds. bad and good of sheet balance a not is justice Transitional\"", "correct_output": "Transitional justice is not a balance sheet of good and bad deeds."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "teacher. private and tutor a became instead and route traditional the reject to chose she teachers, career become to on went peers her of most and degree, Education of Bachelor a with graduated she when 1993 in Therefore,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"teacher. private and tutor a became instead and route traditional the reject to chose she teachers, career become to on went peers her of most and degree, Education of Bachelor a with graduated she when 1993 in Therefore,\"", "correct_output": "Therefore, in 1993 when she graduated with a Bachelor of Education degree, and most of her peers went on to become career teachers, she chose to reject the traditional route and instead became a tutor and private teacher."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "use? public and maintenance, preservation, for places certain aside set U.S. the does Why", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"use? public and maintenance, preservation, for places certain aside set U.S. the does Why\"", "correct_output": "Why does the U.S. set aside certain places for preservation, maintenance, and public use?"}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "participation. community and awareness education, monitoring, habitat enforcement, like actions government-based into influence local weave to ability its to credited be can co-management of success The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"participation. community and awareness education, monitoring, habitat enforcement, like actions government-based into influence local weave to ability its to credited be can co-management of success The\"", "correct_output": "The success of co-management can be credited to its ability to weave local influence into government-based actions like enforcement, habitat monitoring, education, awareness and community participation."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "exhibitions. and festivals, traditional shows, family and children's contests, photography seminars, and lectures concerts, as such activities, recreational and cultural with participation citizen and life social stimulate to sought also They", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"exhibitions. and festivals, traditional shows, family and children's contests, photography seminars, and lectures concerts, as such activities, recreational and cultural with participation citizen and life social stimulate to sought also They\"", "correct_output": "They also sought to stimulate social life and citizen participation with cultural and recreational activities, such as concerts, lectures and seminars, photography contests, children's and family shows, traditional festivals, and exhibitions."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "angle. of kind that from received was it that see to sad is It", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"angle. of kind that from received was it that see to sad is It\"", "correct_output": "It is sad to see that it was received from that kind of angle."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "States. United the and Europe Russia, Asia, Central from media international and regional of dozens by quoted been have we events, covering when years, two past the over Moreover,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"States. United the and Europe Russia, Asia, Central from media international and regional of dozens by quoted been have we events, covering when years, two past the over Moreover,\"", "correct_output": "Moreover, over the past two years, when covering events, we have been quoted by dozens of regional and international media from Central Asia, Russia, Europe and the United States."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "requirement. this fit to donors foreign for difficult it making narrowed, also was donor a of definition The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"requirement. this fit to donors foreign for difficult it making narrowed, also was donor a of definition The\"", "correct_output": "The definition of a donor was also narrowed, making it difficult for foreign donors to fit this requirement."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "was. she who to true live to wanted also she teacher, a be to wanted she as much As", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"was. she who to true live to wanted also she teacher, a be to wanted she as much As\"", "correct_output": "As much as she wanted to be a teacher, she also wanted to live true to who she was."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "dedication. tireless her in waver she did nor craft, artistic the for passion her regretted never She", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"dedication. tireless her in waver she did nor craft, artistic the for passion her regretted never She\"", "correct_output": "She never regretted her passion for the artistic craft, nor did she waver in her tireless dedication."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "rule. his under come has cooperation of phase productive and active most The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"rule. his under come has cooperation of phase productive and active most The\"", "correct_output": "The most active and productive phase of cooperation has come under his rule."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "another. one with dialogue a maintained parts different those centuries, these all for Miraculously,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"another. one with dialogue a maintained parts different those centuries, these all for Miraculously,\"", "correct_output": "Miraculously, for all these centuries, those different parts maintained a dialogue with one another."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "it. behind stands who clear not is it because resource, a as us in confidence reduces it hand, other the on but pressure, hypothetical any from team our protects this hand, one the On", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"it. behind stands who clear not is it because resource, a as us in confidence reduces it hand, other the on but pressure, hypothetical any from team our protects this hand, one the On\"", "correct_output": "On the one hand, this protects our team from any hypothetical pressure, but on the other hand, it reduces confidence in us as a resource, because it is not clear who stands behind it."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "resources. human adequate and support government robust of lack the to due challenges faces arena, mountaineering global the lead to potential its despite Nepal,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"resources. human adequate and support government robust of lack the to due challenges faces arena, mountaineering global the lead to potential its despite Nepal,\"", "correct_output": "Nepal, despite its potential to lead the global mountaineering arena, faces challenges due to the lack of robust government support and adequate human resources."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "declared. it have to need you country, another in money withdraw To", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"declared. it have to need you country, another in money withdraw To\"", "correct_output": "To withdraw money in another country, you need to have it declared."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "pragmatic. be should art crisis, of times In", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"pragmatic. be should art crisis, of times In\"", "correct_output": "In times of crisis, art should be pragmatic."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "deplorable. quite is level university the at situation The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"deplorable. quite is level university the at situation The\"", "correct_output": "The situation at the university level is quite deplorable."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "city. capital the of heart the in Square Independence of end eastern the at sits which Conception, Immaculate the of Cathedral the at place takes largest the tradition, procession the continue country the across parishes Catholic Roman various While", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"city. capital the of heart the in Square Independence of end eastern the at sits which Conception, Immaculate the of Cathedral the at place takes largest the tradition, procession the continue country the across parishes Catholic Roman various While\"", "correct_output": "While various Roman Catholic parishes across the country continue the procession tradition, the largest takes place at the Cathedral of the Immaculate Conception, which sits at the eastern end of Independence Square in the heart of the capital city."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "abroad. opportunities seek to intend — children little with those especially — life of walks all from Turks, that signs are there Already,", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"abroad. opportunities seek to intend — children little with those especially — life of walks all from Turks, that signs are there Already,\"", "correct_output": "Already, there are signs that Turks, from all walks of life — especially those with little children — intend to seek opportunities abroad."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "communities. our in transformations similar see to long us of many majority, global the from storytelling and media publishes which Voices, Global at Here", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"communities. our in transformations similar see to long us of many majority, global the from storytelling and media publishes which Voices, Global at Here\"", "correct_output": "Here at Global Voices, which publishes media and storytelling from the global majority, many of us long to see similar transformations in our communities."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "mountaineers. for destination popular a it making Nepal, in located are world the in peaks mountain highest ten top the of Eight", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"mountaineers. for destination popular a it making Nepal, in located are world the in peaks mountain highest ten top the of Eight\"", "correct_output": "Eight of the top ten highest mountain peaks in the world are located in Nepal, making it a popular destination for mountaineers."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "rumour. and conjecture on rely to appeared cited newspaper the sources The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"rumour. and conjecture on rely to appeared cited newspaper the sources The\"", "correct_output": "The sources the newspaper cited appeared to rely on conjecture and rumour."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "afterwards. country the leave to had organizations those of managers the of Some", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"afterwards. country the leave to had organizations those of managers the of Some\"", "correct_output": "Some of the managers of those organizations had to leave the country afterwards."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "oars. like equipment basic even and boats, hands, strength, people, of shortage a facing are We", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"oars. like equipment basic even and boats, hands, strength, people, of shortage a facing are We\"", "correct_output": "We are facing a shortage of people, strength, hands, boats, and even basic equipment like oars."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "funding. insufficient with struggle often which regions, the to delegated was protection forest for responsibility The", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"funding. insufficient with struggle often which regions, the to delegated was protection forest for responsibility The\"", "correct_output": "The responsibility for forest protection was delegated to the regions, which often struggle with insufficient funding."}
{"task_name": "reverse_dec", "example_type": "revdec", "task_instruction": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"%s\"", "input": "countries. other and Europe USA, the by followed Tajikistan, and Russia in located are statistics, the by judging readers, our of Most", "instruction_plus_input": "Reverse the following sequence of words. Punctuation marks should be moved along with the words that they are attached to: \"countries. other and Europe USA, the by followed Tajikistan, and Russia in located are statistics, the by judging readers, our of Most\"", "correct_output": "Most of our readers, judging by the statistics, are located in Russia and Tajikistan, followed by the USA, Europe and other countries."}
