able
unable
abaxial
dorsal
adaxial
ventral
acroscopic
basiscopic
abducent
abducting
adducent
adductive
adducting
nascent
emergent
emerging
dissilient
parturient
dying
moribund
last
abridged
cut
shortened
potted
unabridged
uncut
absolute
direct
implicit
unquestioning
infinite
living
relative
comparative
relational
absorbent
absorptive
absorbefacient
sorbefacient
assimilating
assimilative
assimilatory
hygroscopic
receptive
spongy
spongelike
thirsty
nonabsorbent
nonabsorptive
repellent
resistant
adsorbent
adsorptive
chemisorptive
chemosorptive
nonadsorbent
nonadsorptive
absorbable
adsorbable
adsorbate
abstemious
abstinent
abstentious
ascetic
ascetical
austere
spartan
gluttonous
crapulous
crapulent
edacious
esurient
rapacious
ravening
ravenous
voracious
wolfish
greedy
hoggish
piggish
piggy
porcine
swinish
overgreedy
abstract
conceptional
ideational
notional
conceptual
ideal
ideological
ideologic
concrete
objective
real
tangible
abundant
abounding
galore
ample
copious
plenteous
plentiful
rich
voluminous
easy
exuberant
lush
luxuriant
profuse
riotous
thick
long
overabundant
plethoric
rife
rampant
rank
superabundant
teeming
torrential
verdant
scarce
rare
tight
abused
maltreated
mistreated
battered
unabused
acceptable
bankable
unexceptionable
unimpeachable
unobjectionable
unacceptable
exceptionable
objectionable
accessible
approachable
reachable
getatable
handy
inaccessible
unaccessible
outback
remote
pathless
roadless
trackless
untracked
untrod
untrodden
unapproachable
unreachable
unreached
ungetatable
accommodating
accommodative
complaisant
obliging
unaccommodating
unobliging
disobliging
uncooperative
accurate
close
faithful
surgical
straight
true
veracious
right
inaccurate
away
outside
faulty
incorrect
wrong
unfaithful
wide
accustomed
unaccustomed
new
unused
acidic
acid
alkaline
alkalic
alkalescent
alcalescent
basic
saltlike
amphoteric
amphiprotic
acidophilic
acidophilous
aciduric
acknowledged
accepted
recognized
recognised
assumptive
declarable
given
granted
putative
unacknowledged
unappreciated
unsung
unvalued
unavowed
secret
unconfessed
unrecognized
unrecognised
acquisitive
accumulative
avaricious
covetous
grabby
grasping
prehensile
possessive
plundering
predaceous
predacious
predatory
sordid
unacquisitive
acropetal
basipetal
active
about
astir
acrobatic
athletic
gymnastic
agile
nimble
quick
spry
hot
hyperactive
overactive
sporty
inactive
deskbound
abeyant
dormant
hypoactive
underactive
inert
sluggish
soggy
torpid
sedentary
activated
off
retired
brisk
bustling
busy
going
open
springy
dark
dead
dull
slow
idle
strikebound
progressive
flat
indolent
latent
quiescent
activist
activistic
proactive
passive
resistless
supine
unresisting
eruptive
extinct
alive
live
dynamic
stative
counteractive
quiet
actual
existent
effective
potential
possible
acute
subacute
chronic
degenerative
virulent
deadly
avirulent
adaptive
adaptative
reconciling
adaptational
adjustive
maladaptive
dysfunctional
nonadaptive
maladjustive
addicted
alcoholic
dependent
dependant
hooked
unaddicted
clean
addictive
nonaddictive
additive
cumulative
addable
addible
extra
additional
complemental
complementary
completing
incremental
intercalary
summational
summative
supplementary
supplemental
subtractive
ablative
reductive
addressed
unaddressed
adequate
equal
capable
competent
inadequate
unequal
deficient
lacking
wanting
incapable
incompetent
undermanned
understaffed
adhesive
adherent
agglutinate
agglutinative
bondable
coherent
tenacious
cohesive
gluey
glutinous
gummy
mucilaginous
pasty
sticky
viscid
viscous
gooey
icky
gummed
pitchy
resinous
resiny
tarry
nonadhesive
nonglutinous
nonviscid
nonresinous
nonresiny
ungummed
adjective
procedural
substantive
essential
adoptable
unadoptable
adorned
decorated
beady
gemmed
jeweled
jewelled
sequined
spangled
spangly
bedaubed
bespectacled
monocled
spectacled
brocaded
embossed
raised
buttony
carbuncled
champleve
cloisonne
clinquant
tinseled
tinselly
crested
plumed
topknotted
tufted
crocketed
feathery
feathered
plumy
frilled
frilly
ruffled
fringed
inflamed
inlaid
inwrought
tessellated
mounted
paneled
wainscoted
studded
tapestried
tasseled
tasselled
unadorned
undecorated
plain
bare
spare
unembellished
unornamented
untufted
cholinergic
anticholinergic
adroit
neat
clever
cunning
ingenious
coordinated
deft
dexterous
dextrous
maladroit
bumbling
bungling
butterfingered
handless
inept
tactless
uncoordinated
unmechanical
nonmechanical
advantageous
beneficial
good
plus
positive
discriminatory
preferential
disadvantageous
minus
negative
adventurous
adventuresome
audacious
daring
venturesome
venturous
sporting
swaggering
swashbuckling
unadventurous
safe
advisable
better
best
well
inadvisable
unadvisable
advised
considered
unadvised
aerobic
aerophilic
aerophilous
aerobiotic
oxidative
anaerobic
anaerobiotic
aesthetic
esthetic
aesthetical
esthetical
artistic
cosmetic
enhancive
painterly
sensuous
inaesthetic
unaesthetic
inartistic
unartistic
affected
impressed
smitten
stricken
struck
subject
taken
unaffected
immune
superior
unimpressed
uninfluenced
unswayed
untouched
unnatural
agonistic
strained
artificial
contrived
hokey
stilted
constrained
forced
elocutionary
mannered
plummy
lifelike
natural
unmannered
unselfconscious
unstilted
affirmative
affirmatory
assentient
dissentient
dissenting
dissident
acceptive
accepting
rejective
dismissive
repudiative
afloat
adrift
floating
waterborne
aground
afraid
acrophobic
afeard
afeared
aghast
appalled
dismayed
shocked
agoraphobic
alarmed
algophobic
apprehensive
hangdog
claustrophobic
fearful
frightened
scared
horrified
hunted
hydrophobic
aquaphobic
mysophobic
panicky
panicked
terrified
numb
shitless
triskaidekaphobic
unnerved
xenophobic
unafraid
fearless
unapprehensive
unblinking
unflinching
unintimidated
unshrinking
unfrightened
aggressive
battleful
bellicose
combative
competitive
militant
hostile
obstreperous
raptorial
vulturine
vulturous
pugnacious
rough
scrappy
truculent
unaggressive
nonaggressive
agitated
aroused
emotional
excited
distraught
overwrought
jolted
shaken
feverish
hectic
frantic
frenetic
phrenetic
frenzied
hysterical
psychedelic
unagitated
churning
roiling
roiled
roily
turbulent
rippled
seething
stirred
nonturbulent
unstirred
agreeable
disagreeable
annoying
bothersome
galling
irritating
nettlesome
pesky
pestering
pestiferous
plaguy
plaguey
teasing
vexatious
vexing
harsh
abrasive
stressful
trying
unsweet
alert
watchful
vigilant
wakeful
fly
lidless
sleepless
unalert
unwatchful
unvigilant
algorithmic
recursive
heuristic
alienable
appropriable
assignable
conveyable
negotiable
transferable
transferrable
inalienable
unalienable
infrangible
inviolable
nontransferable
unassignable
untransferable
liveborn
viable
vital
asleep
deceased
departed
gone
assassinated
bloodless
exsanguine
exsanguinous
breathless
inanimate
pulseless
cold
deathlike
deathly
defunct
doomed
executed
fallen
late
lifeless
exanimate
murdered
nonviable
slain
stillborn
apocrine
eccrine
artesian
subartesian
out
alphabetic
alphabetical
abecedarian
alphabetized
alphabetised
analphabetic
altricial
precocial
altruistic
selfless
egoistic
egoistical
egocentric
ambiguous
enigmatic
oracular
multivalent
polysemous
polysemantic
uncertain
unambiguous
monosemous
ambitious
pushful
pushy
aspirant
aspiring
wishful
compulsive
determined
driven
manque
overambitious
unambitious
ambitionless
shiftless
ametropic
emmetropic
full
generous
meager
meagre
meagerly
stingy
scrimpy
scanty
exiguous
hardscrabble
measly
miserable
paltry
anabolic
catabolic
katabolic
anaclinal
cataclinal
anastigmatic
stigmatic
astigmatic
anticlinal
synclinal
anadromous
catadromous
diadromous
anabatic
katabatic
catabatic
anal
oral
analogue
analog
linear
digital
analytic
analytical
synthetic
synthetical
uninflected
isolating
polysynthetic
inflectional
derivational
apocarpous
syncarpous
angry
aggravated
provoked
angered
enraged
furious
infuriated
maddened
black
choleric
irascible
huffy
mad
sore
indignant
incensed
outraged
umbrageous
irate
ireful
livid
smoldering
smouldering
wrathful
wroth
wrothful
unangry
resentful
acrimonious
bitter
rancorous
unresentful
unbitter
sentient
animate
sensate
insentient
insensate
unfeeling
nonliving
nonconscious
animated
enlivened
spirited
lively
reanimated
revived
unanimated
wan
unenlivened
anonymous
nameless
unidentified
unknown
unnamed
onymous
binomial
binominal
pseudonymous
antemortem
postmortem
postmortal
antecedent
anterior
prior
anticipatory
prevenient
preexistent
preexisting
subsequent
attendant
consequent
accompanying
concomitant
incidental
ensuant
resultant
sequent
later
ulterior
posterior
antrorse
retrorse
decurved
aquatic
marine
semiaquatic
subaquatic
subaqueous
submerged
submersed
underwater
terrestrial
onshore
overland
amphibious
amphibiotic
preceding
above
foregoing
introductory
prefatorial
prefatory
precedent
premedical
preparatory
preparative
propaedeutic
previous
old
succeeding
consecutive
ensuing
following
undermentioned
next
precedented
unprecedented
unexampled
nonprehensile
prenatal
antenatal
antepartum
perinatal
postnatal
postpartum
preprandial
postprandial
prewar
postwar
retrograde
anterograde
antemeridian
postmeridian
frontal
prefrontal
back
hind
hinder
caudal
retral
dorsoventral
appealable
unappealable
appendaged
unappendaged
appetizing
appetising
savory
savoury
unappetizing
unappetising
offish
standoffish
appropriate
befitting
pat
proper
inappropriate
unbefitting
improper
due
callable
collect
cod
collectible
collectable
payable
delinquent
overdue
receivable
repayable
undue
apropos
apposite
apt
pertinent
malapropos
inapposite
apteral
amphiprostylar
amphiprostyle
amphistylar
porticoed
prostyle
pseudoprostyle
peripteral
monopteral
peristylar
pseudoperipteral
arbitrable
nonarbitrable
columned
columnar
columniform
columnlike
colonnaded
pillared
noncolumned
uncolumned
astylar
unpillared
arboreal
arboreous
nonarboreal
arenaceous
sandy
sandlike
argillaceous
clayey
armed
equipped
weaponed
militarized
militarised
unarmed
barehanded
defenseless
defenceless
weaponless
armored
armoured
bulletproof
mailed
scaled
unarmored
unarmoured
barbed
barbellate
briary
briery
bristled
bristly
burred
burry
prickly
setose
setaceous
spiny
thorny
bristlelike
brushlike
thistlelike
clawed
taloned
thornless
spineless
armlike
brachiate
armless
scaly
scaley
scaleless
artful
crafty
dodgy
foxy
guileful
knavish
slick
sly
tricksy
tricky
wily
cute
precious
designing
scheming
deep
elusive
manipulative
pawky
artless
careless
articulate
eloquent
facile
fluent
silver
inarticulate
unarticulate
aphasic
aphonic
voiceless
dumb
mute
silent
incoherent
tongueless
unspoken
wordless
speechless
unarticulated
speaking
tongued
nonspeaking
articulated
jointed
unjointed
ashamed
discredited
disgraced
dishonored
shamed
embarrassed
humiliated
mortified
guilty
shamefaced
sheepish
unashamed
barefaced
bodacious
brassy
brazen
insolent
shameless
unblushing
unabashed
unembarrassed
assertive
cocky
emphatic
forceful
unassertive
nonassertive
reticent
retiring
associative
associatory
associable
nonassociative
attached
committed
bespoken
betrothed
intended
involved
unattached
uncommitted
unengaged
unpledged
unpromised
affixed
appendant
basifixed
glued
pasted
unaffixed
loose
sessile
stalkless
pedunculate
stalked
vagile
detached
freestanding
separate
semidetached
stuck
cragfast
unstuck
attachable
bindable
detachable
clastic
wary
shy
unwary
gullible
unguarded
attentive
captive
absorbed
engrossed
enwrapped
intent
wrapped
advertent
heedful
observant
oversolicitous
solicitous
inattentive
absent
absentminded
abstracted
scatty
distracted
distrait
dreamy
moony
woolgathering
drowsy
oscitant
yawning
forgetful
oblivious
attractive
bewitching
captivating
enchanting
enthralling
entrancing
fascinating
charismatic
magnetic
dinky
engaging
piquant
fetching
taking
winning
glossy
showy
hypnotic
mesmeric
mesmerizing
spellbinding
irresistible
personable
photogenic
prepossessing
winsome
unattractive
homely
subfusc
unprepossessing
unpresentable
repulsive
appealing
catchy
unappealing
attributable
ascribable
imputable
referable
credited
traceable
unattributable
unascribable
attributive
prenominal
predicative
pregnant
big
enceinte
expectant
gravid
great
large
heavy
nonpregnant
audible
hearable
clunky
sonic
sounding
inaudible
unhearable
breathed
infrasonic
unsounded
supersonic
ultrasonic
unheard
transonic
subsonic
auspicious
bright
hopeful
promising
fortunate
rosy
inauspicious
unfortunate
unpromising
propitious
golden
favorable
favourable
lucky
prosperous
gracious
unpropitious
ill
ominous
thunderous
authorized
authorised
accredited
commissioned
licensed
licenced
approved
sanctioned
canonized
canonised
glorified
empowered
sceptered
sceptred
unauthorized
unauthorised
unaccredited
unlicensed
unlicenced
constitutional
unconstitutional
autochthonous
allochthonous
autoecious
homoecious
heteroecious
autogenous
autogenic
heterogenous
heterogeneous
automatic
autoloading
semiautomatic
automated
smart
manual
available
acquirable
addressable
forthcoming
gettable
getable
obtainable
procurable
lendable
visible
purchasable
ready
unavailable
unobtainable
unprocurable
untouchable
awake
up
awakened
insomniac
unsleeping
waking
hibernating
drowsing
dozy
hypnoid
sleepy
sleepyheaded
slumberous
slumbery
slumbrous
somnolent
unawakened
astringent
styptic
hemostatic
nonastringent
aware
cognizant
cognisant
conscious
sensible
unaware
incognizant
unmindful
unconscious
unsuspecting
witting
unwitting
alarming
appalling
dismaying
atrocious
frightful
horrifying
horrible
ugly
awful
dire
direful
dread
dreaded
dreadful
fearsome
frightening
horrendous
horrific
terrible
baleful
forbidding
menacing
minacious
minatory
sinister
threatening
bloodcurdling
nightmarish
chilling
scarey
scary
shivery
shuddery
creepy
formidable
redoubtable
unnerving
ghastly
grim
grisly
gruesome
macabre
sick
hairy
petrifying
stupefying
terrific
terrifying
unalarming
anemophilous
entomophilous
reassuring
assuasive
soothing
assuring
comforting
consolatory
consoling
unreassuring
worrisome
backmost
hindermost
hindmost
rearmost
rear
rearward
front
advance
advanced
foremost
frontmost
leading
directing
directional
directive
guiding
pursuing
backed
hardbacked
hardback
hardbound
hardcover
razorback
backless
backward
backswept
sweptback
cacuminal
retroflex
converse
reversed
transposed
inverse
reverse
receding
reflexive
regardant
retracted
retroflexed
returning
reversive
forward
guardant
gardant
headfirst
headlong
bashful
blate
brash
cheeky
nervy
bumptious
overfamiliar
fresh
impertinent
impudent
overbold
saucy
sassy
wise
assuming
presumptuous
balconied
unbalconied
barreled
barrelled
unbarreled
unbarrelled
beaked
beaklike
billed
duckbill
rostrate
beakless
bedded
bedless
beneficed
unbeneficed
stratified
foliate
foliated
foliaceous
laminar
laminal
layered
superimposed
sheetlike
unstratified
ferned
ferny
braky
fernlike
fernless
grassy
grasslike
rushlike
sedgelike
sedgy
grassless
gusseted
ungusseted
hairless
bald
balding
beardless
depilatory
depilous
glabrescent
glabrous
nonhairy
tonsured
haired
hirsute
canescent
hoary
comate
comose
comal
downy
pubescent
puberulent
sericeous
floccose
furlike
furred
furry
fuzzed
fuzzy
hispid
lanate
woolly
pappose
pilous
pilose
pilary
tomentose
tomentous
wiry
wooly
awned
awny
bearded
awnless
bearing
supporting
nonbearing
beautiful
beauteous
bonny
bonnie
comely
fair
sightly
dishy
exquisite
handsome
glorious
resplendent
splendid
splendiferous
gorgeous
lovely
picturesque
pretty
pulchritudinous
ravishing
scenic
stunning
disfigured
fugly
grotesque
monstrous
hideous
scrofulous
unlovely
unpicturesque
unsightly
bellied
bellyless
banded
unbanded
belted
beltlike
unbelted
beltless
beneficent
benefic
maleficent
baneful
malefic
malevolent
malign
evil
malicious
despiteful
spiteful
vindictive
leering
bitchy
catty
cattish
poisonous
venomous
vicious
venomed
vixenish
unmalicious
benign
benignant
kindly
cancerous
champion
prizewinning
first
optimum
optimal
primo
superfine
unexcelled
unexceeded
unsurpassed
unsurpassable
worst
bottom
lowest
pessimal
pessimum
amended
finer
improved
worse
worsened
fitter
healthier
bettering
ameliorating
ameliorative
amelioratory
meliorative
amendatory
corrective
remedial
worsening
bicameral
unicameral
bidirectional
biface
bifacial
duplex
unidirectional
simplex
unifacial
faced
featured
visaged
faceless
bibbed
bibless
unilateral
multilateral
bilateral
bipartite
joint
multipartite
quadrilateral
quadripartite
tetramerous
trilateral
triangular
tripartite
bimodal
unimodal
binaural
biaural
stereophonic
stereo
monaural
mono
monophonic
binucleate
binuclear
binucleated
mononuclear
mononucleate
trinucleate
trinuclear
trinucleated
bipedal
biped
quadrupedal
quadruped
colored
coloured
negro
negroid
white
blond
blonde
towheaded
fairish
flaxen
nordic
redheaded
brunet
brunette
adust
bronzed
suntanned
tanned
brown
browned
dusky
swart
swarthy
grizzled
nutbrown
blemished
acned
pimpled
pimply
pustulate
blebbed
blebby
blotchy
flyblown
marred
scarred
pocked
pockmarked
unblemished
unmarred
unmutilated
stainless
unstained
unsullied
untainted
untarnished
bloody
bloodstained
gory
bloodsucking
bloodthirsty
sanguinary
crimson
red
violent
homicidal
murderous
sanguineous
slaughterous
butcherly
internecine
nonviolent
unbloody
bold
brave
dauntless
hardy
intrepid
unfearing
daredevil
temerarious
emboldened
foolhardy
heady
rash
reckless
heroic
heroical
overreaching
vaulting
overvaliant
timid
coy
timorous
trepid
intimidated
mousy
mousey
bound
chained
enchained
fettered
shackled
furled
rolled
pinioned
tethered
trussed
tied
wired
unbound
unchained
unfettered
unshackled
untied
untethered
laced
unlaced
fastened
knotted
unfastened
tangled
afoul
foul
fouled
enmeshed
intermeshed
entangled
knotty
snarled
snarly
matted
rootbound
thrown
untangled
disentangled
loosened
unsnarled
brassbound
cased
paperback
paperbacked
looseleaf
bordered
boxed
deckled
featheredged
edged
lined
seagirt
unbordered
lotic
lentic
proletarian
propertyless
bourgeois
conservative
materialistic
quality
propertied
u
tweedy
wellborn
brachycephalic
brachycranial
brachycranic
roundheaded
dolichocephalic
dolichocranial
dolichocranic
courageous
desperate
gallant
game
gamy
gamey
gritty
mettlesome
spunky
lionhearted
stalwart
stouthearted
undaunted
valiant
valorous
cowardly
caitiff
chicken
chickenhearted
yellow
craven
recreant
dastard
dastardly
faint
fainthearted
funky
poltroon
pusillanimous
unmanly
gutsy
plucky
gutless
nursed
suckled
breathing
eupneic
eupnoeic
dyspneic
dyspnoeic
dyspneal
dyspnoeal
asphyxiating
smothering
suffocating
suffocative
blown
pursy
winded
crystalline
crystallized
crystalised
microcrystalline
polycrystalline
noncrystalline
amorphous
uncrystallized
uncrystallised
landed
landless
light
ablaze
reddened
autofluorescent
bioluminescent
candescent
floodlit
floodlighted
fluorescent
illuminated
lighted
lit
incandescent
candent
lamplit
luminescent
phosphorescent
sunlit
sunstruck
aphotic
caliginous
crepuscular
darkened
darkening
darkling
dim
subdued
twilight
twilit
glooming
gloomy
gloomful
sulky
lightless
unilluminated
unlighted
unlit
semidark
tenebrous
tenebrific
tenebrious
shaded
murky
mirky
shady
shadowed
shadowy
unshaded
unshadowed
hatched
crosshatched
moonlit
moonless
bridgeable
unbridgeable
agleam
gleaming
nitid
aglow
lambent
lucent
luminous
aglitter
coruscant
fulgid
glinting
glistering
glittering
glittery
scintillant
scintillating
sparkly
beadlike
buttonlike
beaming
beamy
effulgent
radiant
refulgent
blazing
blinding
dazzling
fulgent
glaring
glary
brilliant
ardent
glimmery
glistening
lustrous
sheeny
shiny
shining
iridescent
nacreous
opalescent
opaline
pearlescent
lurid
noctilucent
satiny
sleek
silken
silky
silklike
shimmery
silvern
silvery
twinkling
mat
matt
matte
lackluster
lacklustre
lusterless
lustreless
soft
dimmed
undimmed
prejudiced
homophobic
jaundiced
loaded
racist
antiblack
sexist
unprejudiced
impartial
nonracist
broad
liberal
tolerant
catholic
latitudinarian
undogmatic
undogmatical
narrow
dogmatic
dogmatical
illiberal
intolerant
opinionated
opinionative
petty
reconstructed
unreconstructed
broken
unbroken
unkept
kept
dashed
dotted
fitful
interrupted
halting
solid
uninterrupted
brotherly
brotherlike
fraternal
sisterly
sisterlike
sororal
exergonic
endergonic
biovular
identical
monovular
buried
inhumed
interred
belowground
unburied
drudging
laboring
labouring
toiling
engaged
occupied
overbusy
faineant
lazy
otiose
slothful
lackadaisical
leisured
bony
boney
bone
boned
bonelike
boneless
deboned
buttoned
botonee
botonnee
unbuttoned
capitalistic
capitalist
individualistic
socialistic
socialist
collective
collectivist
collectivistic
collectivized
collectivised
cacophonous
cacophonic
cackly
squawky
croaky
guttural
grating
gravelly
rasping
raspy
scratchy
gruff
hoarse
husky
jangling
jangly
jarring
raucous
strident
rending
ripping
splitting
euphonious
euphonous
calculable
computable
estimable
countable
denumerable
enumerable
numerable
incalculable
countless
innumerable
innumerous
multitudinous
myriad
numberless
uncounted
unnumberable
unnumbered
unnumerable
incomputable
inestimable
immeasurable
indeterminable
calm
placid
still
tranquil
smooth
unruffled
settled
windless
stormy
raging
tempestuous
wild
billowy
billowing
surging
blustering
blusterous
blustery
boisterous
fierce
blowy
breezy
windy
choppy
dirty
gusty
puffy
squally
thundery
camphorated
uncamphorated
confident
surefooted
resourceful
attended
neglected
unattended
untended
careful
certain
sure
conscientious
painstaking
scrupulous
detailed
elaborate
elaborated
minute
overcareful
particular
protective
studious
thorough
casual
cursory
passing
perfunctory
haphazard
slapdash
slipshod
sloppy
heedless
incautious
offhand
offhanded
carnivorous
zoophagous
piscivorous
herbivorous
anthophagous
anthophilous
baccivorous
carpophagous
phytophagic
phytophagous
phytophilous
saprophagous
saprozoic
saprophytic
omnivorous
insectivorous
apivorous
myrmecophagous
holozoic
holophytic
carpellate
pistillate
acarpelous
acarpellous
carpeted
uncarpeted
carved
carven
engraved
etched
graven
incised
inscribed
sculpted
sculptured
lapidarian
sliced
uncarved
acatalectic
catalectic
hypercatalectic
cauline
radical
basal
censored
expurgated
uncensored
unexpurgated
caudate
caudated
bobtail
bobtailed
taillike
tailed
acaudate
acaudal
anurous
tailless
caulescent
stemmed
acaulescent
stemless
causative
abortifacient
activating
actuating
anorectic
anorexigenic
causal
conducive
contributing
contributive
contributory
tributary
errhine
fast
inductive
inducive
motivative
motive
motivating
motor
precipitating
responsible
sternutatory
sternutative
noncausative
noncausal
cautious
cagey
cagy
chary
fabian
gingerly
guarded
restrained
overcautious
hotheaded
impulsive
impetuous
madcap
tearaway
brainish
cellular
cancellate
cancellated
cancellous
alveolate
faveolate
cavitied
honeycombed
pitted
multicellular
noncellular
acellular
compartmented
compartmental
compartmentalized
compartmentalised
uncompartmented
porous
poriferous
porose
nonporous
central
amidship
bicentric
bifocal
center
halfway
middle
midway
centered
centric
centrical
focal
median
medial
middlemost
midmost
nuclear
peripheral
circumferential
fringy
marginal
encircling
skirting
centrifugal
centripetal
afferent
sensory
corticoafferent
corticipetal
efferent
motorial
corticoefferent
corticofugal
corticifugal
neuromotor
centralizing
centralising
unifying
consolidative
integrative
decentralizing
decentralising
definite
indisputable
indefinite
convinced
unsure
incertain
ambivalent
doubtful
dubious
groping
unconvinced
assured
cocksure
overconfident
reassured
diffident
destined
fated
foreordained
predestinate
predestined
chancy
fluky
flukey
iffy
contingent
certified
certifiable
certificated
credentialled
uncertified
inevitable
fatal
fateful
ineluctable
inescapable
unavoidable
necessary
evitable
avoidable
avertible
avertable
preventable
unpreventable
changeable
changeful
adjustable
astatic
checkered
distortable
erratic
fickle
mercurial
quicksilver
fluid
unstable
mobile
jittering
kaleidoscopic
kaleidoscopical
reversible
volatile
unchangeable
changeless
unalterable
confirmed
fixed
frozen
static
stable
unchanging
commutable
alterable
convertible
transformable
translatable
transmutable
incommutable
inconvertible
untransmutable
inalterable
incurable
final
modifiable
unmodifiable
adjusted
focused
weighted
unadjusted
maladjusted
unadapted
altered
changed
emended
edited
paraphrastic
revised
unaltered
unchanged
dateless
timeless
unmoved
unedited
unreduced
unrevised
unamended
denatured
denaturized
denaturised
exchanged
transformed
varied
idempotent
same
isometric
isotonic
ionized
ionised
nonionized
nonionised
unionized
unionised
nonionic
mutable
immutable
characteristic
diagnostic
symptomatic
distinctive
typical
peculiar
uncharacteristic
charged
electronegative
electropositive
polar
uncharged
neutral
electroneutral
drained
charitable
benevolent
eleemosynary
philanthropic
uncharitable
chartered
hired
leased
unchartered
owned
unowned
ownerless
chaste
celibate
continent
pure
vestal
virgin
virginal
virtuous
unchaste
cyprian
promiscuous
sluttish
wanton
licentious
cheerful
glad
beamish
smiling
twinkly
blithe
blithesome
lighthearted
lightsome
buoyant
chirpy
perky
cheery
gay
sunny
chipper
debonair
debonaire
jaunty
depressing
cheerless
uncheerful
blue
dingy
disconsolate
dismal
sorry
drab
drear
dreary
somber
sombre
melancholy
chlamydeous
achlamydeous
chondritic
granular
achondritic
monoclinic
triclinic
anorthic
monochromatic
homochromatic
polychromatic
chromatic
amber
amethyst
auburn
aureate
gilded
gilt
gold
avocado
azure
cerulean
beige
blae
bluish
blueish
cyan
teal
blushful
bronze
bronzy
brownish
buff
canary
caramel
carnation
chartreuse
chestnut
coppery
coral
creamy
cresson
watercress
dun
earthlike
fuscous
taupe
green
greenish
hazel
honey
jade
khaki
lavender
lilac
magenta
maroon
mauve
mosstone
mouselike
ocher
ochre
olive
orange
orangish
peachy
pink
pinkish
salmon
purple
violet
purplish
reddish
ruddy
carmine
cerise
cherry
ruby
scarlet
rose
roseate
rosaceous
russet
rust
rusty
sage
sapphire
snuff
sorrel
stone
straw
tan
tannish
tangerine
tawny
ultramarine
umber
vermilion
vermillion
cinnabar
vinaceous
yellowish
xanthous
achromatic
argent
silverish
ashy
blackish
chalky
charcoal
jet
sooty
ebon
ebony
grey
gray
greyish
grayish
hueless
inky
pearly
sable
slaty
slatey
snowy
whitish
albescent
saturated
intense
vivid
unsaturated
color
colour
colorful
flushed
bay
bicolor
bicolour
bicolored
bicoloured
bichrome
dichromatic
blackened
ginger
gingery
indigo
liver
monochrome
monochromic
monochromous
motley
calico
multicolor
multicolour
multicolored
multicoloured
painted
particolored
particoloured
piebald
pied
varicolored
varicoloured
polychrome
polychromic
roan
trichromatic
trichrome
tricolor
uncolored
uncoloured
achromatous
achromic
achromous
stained
untreated
colourful
chatoyant
shot
prismatic
shrill
vibrant
colorless
colourless
ashen
blanched
bleached
faded
washy
sober
dulled
greyed
etiolate
etiolated
pale
pallid
pastelike
prefaded
waxen
waxlike
waxy
whitened
braw
flashy
gaudy
jazzy
noisy
palish
pastel
powdery
darkish
diatonic
cismontane
cisalpine
ultramontane
tramontane
transmontane
transalpine
christian
christianly
christlike
christly
unchristian
christless
nonchristian
unchristianly
unchristlike
civilized
civilised
civil
humane
noncivilized
noncivilised
barbarian
barbaric
savage
uncivilized
uncivilised
barbarous
preliterate
nonliterate
primitive
classical
classic
neoclassic
neoclassical
nonclassical
modern
popular
pop
classified
categorized
categorised
grouped
sorted
unclassified
uncategorized
uncategorised
unsorted
confidential
restricted
sensitive
declassified
nonsensitive
unrestricted
analyzed
unanalyzed
crude
raw
cleanable
cleanly
immaculate
speckless
spic
spick
spotless
pristine
scrubbed
unsoiled
unspotted
washed
soiled
unclean
bedraggled
draggled
befouled
begrimed
grimy
grubby
grungy
raunchy
smutty
buggy
cobwebby
feculent
filthy
nasty
squalid
greasy
oily
lousy
maculate
mucky
muddy
ratty
scummy
smudgy
snotty
uncleanly
unswept
unwashed
antiseptic
bawdy
ribald
blasphemous
profane
cruddy
lewd
obscene
salacious
scabrous
scatological
uncontaminating
contaminating
radioactive
nonradioactive
halal
kosher
cosher
impure
nonkosher
tref
terefah
clear
unsubtle
distinct
trenchant
limpid
lucid
luculent
pellucid
perspicuous
unmistakable
unclear
blurred
clouded
confusing
perplexing
puzzling
obscure
vague
transparent
hyaline
hyaloid
liquid
translucent
semitransparent
unclouded
unfrosted
opaque
cloudy
turbid
fogged
foggy
frosted
glaucous
lightproof
milky
milklike
semiopaque
radiolucent
radiopaque
clearheaded
confused
addlebrained
addlepated
puddingheaded
muddleheaded
addled
befuddled
muddled
muzzy
befogged
dazed
stunned
stupefied
stupid
dazzled
trancelike
silly
slaphappy
clement
lenient
inclement
unsparing
balmy
mild
astute
sharp
shrewd
canny
streetwise
anserine
dopy
dopey
foolish
goosey
goosy
gooselike
jerky
blockheaded
boneheaded
duncical
duncish
fatheaded
loggerheaded
thickheaded
cloddish
doltish
dense
obtuse
gaumless
gormless
lumpish
lumpen
unthinking
nitwitted
senseless
witless
weak
clockwise
dextrorotary
dextrorotatory
counterclockwise
anticlockwise
contraclockwise
levorotary
levorotatory
far
distant
removed
faraway
farther
farthermost
farthest
furthermost
furthest
utmost
uttermost
further
outlying
near
nigh
adjacent
nearby
warm
extreme
nonadjacent
yonder
yon
ambient
appressed
adpressed
approximate
imminent
impendent
impending
contiguous
immediate
encompassing
surrounding
circumferent
enveloping
juxtaposed
nestled
snuggled
proximate
scalelike
walking
boon
chummy
cozy
dear
familiar
intimate
cousinly
uncousinly
clothed
clad
appareled
attired
dressed
garbed
garmented
habilimented
robed
arrayed
panoplied
breeched
pantalooned
trousered
caparisoned
cassocked
coated
costumed
cowled
dighted
gowned
habited
overdressed
petticoated
suited
surpliced
togged
tuxedoed
underdressed
uniformed
vestmented
unclothed
naked
nude
peeled
braless
topless
bareheaded
bared
barelegged
bottomless
clothesless
garmentless
raimentless
exposed
uncovered
underclothed
seminude
starkers
stripped
unappareled
unattired
unclad
undressed
ungarbed
ungarmented
saddled
unsaddled
bareback
barebacked
cloudless
serene
brumous
hazy
misty
fogbound
overcast
sunless
cloudlike
nebular
leaden
lowering
sullen
miasmal
miasmic
vaporous
vapourous
smoggy
coastal
coastwise
inshore
maritime
seaward
inland
interior
midland
upcountry
landlocked
shoreward
offshore
consistent
logical
ordered
seamless
disconnected
disjointed
disordered
garbled
illogical
scattered
unconnected
collapsible
collapsable
foldable
foldaway
folding
telescopic
noncollapsible
noncollapsable
nontelescopic
nontelescoping
crannied
uncrannied
agglomerate
agglomerated
agglomerative
clustered
aggregate
aggregated
aggregative
mass
knockdown
distributive
allocable
allocatable
apportionable
diffusing
diffusive
dispersive
disseminative
immanent
permeant
permeating
permeative
pervasive
separative
suffusive
publicized
publicised
advertised
heralded
promulgated
published
suppressed
burked
quelled
quenched
squelched
unreleased
unpublished
publishable
unpublishable
reported
according
notifiable
reportable
unreported
unreportable
combinative
combinatory
combinatorial
combinable
combinational
noncombinative
noncombining
combustible
burnable
ignitable
ignitible
comburent
comburant
combustive
flammable
inflammable
ignescent
incendiary
noncombustible
incombustible
fireproof
flameproof
nonflammable
explosive
detonative
nonexplosive
afire
aflame
aflare
alight
ignited
enkindled
kindled
unkindled
commodious
convenient
roomy
spacious
incommodious
cramped
comfortable
comfy
cosy
snug
homelike
homey
homy
uncomfortable
bad
tough
comfortless
painful
wretched
uneasy
comforted
awkward
disquieting
commensurate
coextensive
coterminous
conterminous
commensurable
proportionate
incommensurate
disproportionate
incommensurable
proportionable
proportional
disproportional
commercial
commercialized
commercialised
mercantile
mercenary
moneymaking
technical
noncommercial
nonprofit
uncommercial
uncommercialized
uncommercialised
residential
nonresidential
noncommissioned
common
average
ordinary
democratic
demotic
frequent
general
grassroots
standard
uncommon
especial
exceptional
special
unusual
unwonted
usual
customary
habitual
wonted
inveterate
regular
different
extraordinary
odd
unique
hydrophilic
deliquescent
oleophilic
lipophilic
lipotropic
oleophobic
communal
public
individual
single
idiosyncratic
individualist
respective
several
various
singular
communicative
communicatory
anecdotic
anecdotal
anecdotical
blabbermouthed
leaky
talebearing
tattling
chatty
gossipy
newsy
communicable
communicational
expansive
talkative
expressive
gesticulating
gestural
nonverbal
sign
signed
heraldic
narrative
openhearted
outspoken
vocal
verbal
uncommunicative
incommunicative
blank
vacuous
closelipped
closemouthed
secretive
tightlipped
deadpan
expressionless
impassive
unexpressive
incommunicado
inexpressive
mum
unpronounceable
unutterable
compact
cloggy
consolidated
impacted
wedged
packed
serried
shifting
unfirm
silty
unconsolidated
comparable
incomparable
uncomparable
matchless
nonpareil
one
peerless
unmatched
unmatchable
unrivaled
unrivalled
alone
unequaled
unequalled
unparalleled
compassionate
caring
nurturant
tenderhearted
uncompassionate
hardhearted
stonyhearted
compatible
congenial
congruous
harmonious
incompatible
antagonistic
clashing
contradictory
uncongenial
miscible
mixable
immiscible
unmixable
efficient
workmanlike
feckless
ineffective
inefficient
unworkmanlike
unqualified
competitory
agonistical
emulous
rivalrous
matched
noncompetitive
cooperative
monopolistic
uncompetitive
complaining
complaintive
fretful
querulous
whiney
whiny
protestant
uncomplaining
compressible
compressed
incompressible
whole
entire
total
integral
intact
livelong
undivided
fractional
aliquot
divisional
fragmental
fragmentary
half
pledged
sworn
undecided
dedicated
devoted
sacred
undedicated
complete
downright
sheer
accomplished
completed
realized
realised
all
allover
utter
exhaustive
thoroughgoing
hearty
sound
incomplete
uncomplete
neither
partial
rudimentary
sketchy
unelaborated
uncompleted
comprehensive
blanket
extensive
panoptic
citywide
countywide
countrywide
nationwide
cosmopolitan
ecumenical
oecumenical
universal
worldwide
encyclopedic
encyclopaedic
omnibus
plenary
spatiotemporal
spaciotemporal
schoolwide
statewide
super
umbrella
noncomprehensive
incomprehensive
limited
composed
imperturbable
unflappable
collected
equanimous
poised
cool
coolheaded
nerveless
unflurried
unflustered
unperturbed
discomposed
abashed
chagrined
blushing
bothered
daunted
fazed
discombobulated
disconcerted
flustered
perturbed
rattled
unstrung
comprehensible
comprehendible
apprehensible
intelligible
graspable
perceivable
understandable
fathomable
incomprehensible
uncomprehensible
enigmatical
unfathomable
impenetrable
indecipherable
lost
missed
unintelligible
concave
acetabular
cotyloid
cotyloidal
biconcave
bursiform
pouchlike
saclike
cuplike
cupular
cupulate
dished
patelliform
planoconcave
recessed
umbilicate
convex
bulging
biconvex
lenticular
lentiform
hogged
gibbous
gibbose
planoconvex
umbellate
concentrated
bunchy
cumulous
exclusive
thickset
distributed
apportioned
diffuse
diffused
dispensed
dispersed
spread
divided
shared
encyclical
fanned
widespread
rationed
separated
spaced
sparse
thin
splashed
straggly
unfocused
unfocussed
concentric
concentrical
homocentric
coaxial
coaxal
eccentric
nonconcentric
acentric
concerned
haunted
obsessed
preoccupied
unconcerned
blase
insouciant
nonchalant
degage
uninvolved
indifferent
concise
aphoristic
apothegmatic
epigrammatic
brief
compendious
succinct
summary
crisp
curt
laconic
terse
cryptic
elliptic
elliptical
pithy
sententious
telegraphic
prolix
tedious
verbose
wordy
pleonastic
redundant
tautologic
tautological
conclusive
definitive
determinate
inconclusive
equivocal
indeterminate
nisi
consummated
fulfilled
unconsummated
coordinating
coordinative
subordinating
subordinative
accordant
concordant
concurring
consensual
consentaneous
consentient
unanimous
discordant
discrepant
dissonant
dissentious
divisive
factious
contracted
contractile
expanded
atrophied
wasted
diminished
hypertrophied
enlarged
conditional
counterfactual
qualified
probationary
provisional
provisionary
tentative
provisory
unconditional
unconditioned
blunt
stark
vested
enforceable
unenforceable
enforced
implemented
unenforced
conductive
semiconducting
semiconductive
nonconductive
nonconducting
confined
confining
homebound
housebound
pent
snowbound
stormbound
unconfined
crowded
huddled
jammed
thronged
uncrowded
sociable
unsympathetic
congruent
coincident
superposable
incongruent
incongruous
inconsistent
unfitting
inharmonious
ironic
ironical
conjunctive
copulative
connective
disjunctive
adversative
oppositive
alternative
contrastive
partitive
conjunct
disjunct
connected
neighboring
adjunctive
affined
coupled
joined
linked
apart
isolated
asternal
disjoined
exploded
uncoupled
conquerable
beatable
vanquishable
vincible
subduable
subjugable
unconquerable
impregnable
inexpugnable
indomitable
unsubduable
insuperable
insurmountable
invincible
unbeatable
unvanquishable
semiconscious
comatose
innocent
insensible
kayoed
semicomatose
subconscious
consecrated
consecrate
ordained
votive
desecrated
deconsecrated
profaned
violated
priestly
priestlike
unpriestly
blimpish
fusty
standpat
unprogressive
nonprogressive
hidebound
traditionalist
ultraconservative
liberalistic
neoliberal
reformist
socialized
socialised
welfarist
conformable
consonant
pursuant
reconciled
conflicting
spotty
uneven
unconformable
unreconciled
conspicuous
prominent
crying
egregious
flagrant
gross
marked
outstanding
salient
spectacular
striking
inconspicuous
invisible
unnoticeable
discernible
discernable
indiscernible
distinguishable
differentiable
discriminable
indistinguishable
undistinguishable
constant
steadfast
staunch
unswerving
unfailing
unflagging
inconstant
false
untrue
constructive
creative
formative
shaping
plastic
inferential
reconstructive
rehabilitative
structural
destructive
annihilative
annihilating
devastating
withering
blasting
ruinous
cataclysmal
cataclysmic
caustic
corrosive
erosive
vitriolic
mordant
crushing
damaging
iconoclastic
ravaging
wasteful
contented
content
complacent
satisfied
smug
discontented
discontent
disaffected
malcontent
rebellious
disgruntled
dissatisfied
restless
ungratified
unsatisfied
contestable
challengeable
debatable
disputable
shakable
shakeable
incontestable
incontestible
demonstrable
incontrovertible
demonstrated
inarguable
unarguable
unassailable
unshakable
watertight
unanswerable
incontinent
continual
insistent
repetitive
running
perennial
recurrent
repeated
persistent
relentless
unrelenting
recurring
revenant
sporadic
spasmodic
intermittent
periodic
occasional
irregular
unpredictable
stray
continuous
nonstop
ceaseless
incessant
perpetual
unceasing
unremitting
dogging
persisting
endless
sustained
discontinuous
noncontinuous
disrupted
continued
continuing
discontinued
controlled
contained
disciplined
dominated
harnessed
possessed
regimented
uncontrolled
anarchic
anarchical
lawless
errant
irrepressible
uncontrollable
lordless
masterless
runaway
undisciplined
ungoverned
controversial
arguable
moot
contentious
disputed
polemic
polemical
uncontroversial
noncontroversial
unchallengeable
undisputed
unchallenged
unquestioned
stipulatory
argumentative
quarrelsome
disputatious
disputative
litigious
eristic
eristical
unargumentative
noncontentious
inconvenient
conventional
received
formulaic
stodgy
stuffy
unconventional
bohemian
maverick
unorthodox
square
stereotyped
stereotypic
stereotypical
unimaginative
bizarre
freakish
freaky
flaky
flakey
gonzo
outlandish
outre
raffish
rakish
kinky
offbeat
quirky
spacy
spacey
conformist
nonconformist
unconformist
atomic
thermonuclear
traditional
tralatitious
traditionalistic
nontraditional
untraditional
convergent
confluent
merging
focussed
divergent
diverging
branching
radiating
branchy
arborescent
arboresque
arboriform
dendriform
dendroid
dendroidal
treelike
branched
ramose
ramous
ramate
bushy
maplelike
branchless
palmlike
unbranched
unbranching
convincing
credible
disenchanting
disillusioning
unconvincing
flimsy
unpersuasive
cooked
baked
barbecued
grilled
boiled
poached
stewed
braised
broiled
burned
burnt
done
fried
lyonnaise
medium
overdone
parched
roast
roasted
saute
sauteed
seared
steamed
toasted
underdone
uncooked
untoasted
collaborative
synergetic
synergistic
corrupt
corrupted
debased
vitiated
corruptible
bribable
dishonest
venal
depraved
perverse
perverted
reprobate
putrid
incorrupt
incorruptible
uncorrupted
unspoiled
interactive
antacid
antiphlogistic
considerable
appreciable
goodly
goodish
healthy
hefty
respectable
sizable
sizeable
tidy
significant
substantial
inconsiderable
material
insubstantial
unsubstantial
unreal
aeriform
aerial
airy
aery
ethereal
wraithlike
stringy
physical
immaterial
nonmaterial
intangible
nonphysical
bodied
incarnate
unbodied
bodiless
bodyless
formless
brainwashed
unbrainwashed
corporeal
bodily
corporal
corporate
embodied
reincarnate
incorporeal
discorporate
unembodied
disembodied
spiritual
correct
exact
precise
erroneous
fallacious
mistaken
wrongheaded
corrected
aplanatic
apochromatic
rectified
uncorrected
unremedied
corrigible
amendable
correctable
improvable
redeemable
reformable
incorrigible
unreformable
unregenerate
uncorrectable
unmanageable
traveled
travelled
provincial
bumpkinly
hick
rustic
unsophisticated
insular
parochial
jerkwater
pokey
poky
costive
laxative
aperient
cathartic
evacuant
purgative
constipated
unconstipated
diarrheal
diarrhoeal
diarrhetic
diarrhoetic
diarrheic
diarrhoeic
lax
considerate
thoughtful
inconsiderate
thoughtless
uncaring
courteous
chivalrous
knightly
discourteous
abrupt
brusque
brusk
short
caddish
unchivalrous
ungallant
unceremonious
polite
mannerly
nice
impolite
bratty
brattish
rude
unmannerly
ungracious
unparliamentary
uncivil
sidereal
originative
fanciful
fictive
imaginative
inventive
yeasty
uncreative
sterile
uninspired
uninventive
believable
likely
presumptive
incredible
unbelievable
astounding
dumbfounding
dumfounding
fabulous
improbable
marvelous
marvellous
tall
undreamed
undreamt
unimagined
credulous
overcredulous
incredulous
disbelieving
skeptical
sceptical
unbelieving
critical
captious
faultfinding
censorious
deprecative
hypercritical
overcritical
searing
scathing
vituperative
uncritical
judgmental
nonjudgmental
appraising
evaluative
discriminative
judicial
noncritical
dangerous
grave
grievous
serious
severe
noncrucial
acritical
supercritical
crossed
crosstown
decussate
intersectant
intersecting
uncrossed
walleyed
crowned
capped
chapleted
royal
uncrowned
crownless
uncapped
crucial
important
decisive
pivotal
crystallised
cubic
blockish
blocky
boxlike
boxy
cubelike
cubical
cubiform
cuboid
cuboidal
collinear
lineal
linelike
rectilinear
rectilineal
planar
coplanar
placoid
platelike
planate
flattened
tabular
unidimensional
multidimensional
dimensional
chopped
shredded
perforated
pierced
perforate
punctured
severed
split
imperforate
unpierced
hewn
sheared
slashed
unsheared
curious
inquisitive
speculative
questioning
wondering
nosy
nosey
prying
snoopy
overcurious
incurious
uninterested
uninquiring
uninquisitive
current
afoot
underway
circulating
contemporary
incumbent
occurrent
ongoing
online
topical
latest
noncurrent
disused
obsolete
outdated
superannuated
obsolescent
cursed
curst
accursed
accurst
maledict
blasted
blame
blamed
blessed
damn
damned
darned
deuced
goddam
goddamn
goddamned
infernal
damnable
execrable
blest
endowed
dowered
unendowed
dowerless
unblessed
curtained
draped
curtainless
uncurtained
custom
bespoke
tailored
made
prefab
handmade
handwoven
handsewn
handstitched
overhand
oversewn
homemade
homespun
boughten
manufactured
cyclic
cyclical
alternate
alternating
circular
rotary
orbitual
noncyclic
noncyclical
bicyclic
heterocyclic
homocyclic
isocyclic
acyclic
aliphatic
verticillate
verticillated
whorled
annual
biennial
diurnal
nocturnal
damaged
derelict
dilapidated
ramshackle
tatterdemalion
bent
crumpled
dented
busted
hurt
weakened
riddled
undamaged
datable
dateable
undatable
undated
deaf
deafened
unhearing
hearing
decent
indecent
earthy
vulgar
indelicate
suggestive
deciding
determinant
determinative
determining
peremptory
indecisive
unhesitating
resolute
hesitant
hesitating
suspensive
declarative
declaratory
asserting
interrogative
interrogatory
declared
alleged
announced
proclaimed
asserted
avowed
professed
undeclared
decorous
sedate
staid
indecorous
deductible
allowable
nondeductible
abysmal
abyssal
profound
unfathomed
unplumbed
shallow
fordable
neritic
reefy
shelfy
shelvy
shoaly
wakeless
defeasible
indefeasible
unforfeitable
defeated
licked
subjugated
undefeated
triumphant
victorious
unbeaten
unconquered
unvanquished
unbowed
defiant
noncompliant
insubordinate
resistive
recalcitrant
compliant
amenable
lamblike
nonresistant
defined
undefined
indefinable
undefinable
derived
derivable
derivative
plagiaristic
plagiarized
plagiarised
underived
original
primary
inflected
modulated
decided
nebulous
unfixed
noncommittal
dehiscent
indehiscent
dejected
amort
chapfallen
chopfallen
crestfallen
deflated
depressed
dispirited
down
downcast
downhearted
low
glum
lonely
lonesome
elated
exultant
exulting
jubilant
prideful
rejoicing
triumphal
gladdened
exhilarated
high
sublime
uplifted
delicate
dainty
gossamer
fragile
overdelicate
tender
rugged
knockabout
sturdy
breakable
brittle
brickle
brickly
crumbly
friable
frail
frangible
splintery
unbreakable
shatterproof
splinterless
splinterproof
demanding
exigent
exacting
needy
rigorous
stringent
stern
strict
undemanding
easygoing
unexacting
imperative
adjuratory
clamant
instant
pressing
urgent
beseeching
pleading
imploring
importunate
mendicant
petitionary
precatory
precative
suppliant
supplicant
supplicatory
antiauthoritarian
classless
egalitarian
parliamentary
participatory
representative
republican
undemocratic
authoritarian
autocratic
dictatorial
despotic
tyrannic
tyrannical
monarchal
monarchical
monarchic
totalitarian
arbitrary
capricious
whimsical
discretionary
discretional
nonarbitrary
unarbitrary
prescribed
demonstrative
effusive
gushing
gushy
epideictic
epideictical
undemonstrative
unemotional
deniable
disavowable
questionable
refutable
confutable
confutative
undeniable
undisputable
irrefutable
denotative
denotive
appellative
naming
designative
extensional
referent
referential
connotative
connotational
implicative
intensional
reliable
dependable
tested
tried
undeviating
unreliable
undependable
temperamental
unsound
babelike
helpless
interdependent
mutualist
myrmecophilous
parasitic
parasitical
leechlike
reliant
symbiotic
underage
independent
autarkic
autarkical
autonomous
breakaway
fissiparous
separatist
commutative
nonparasitic
nonsymbiotic
indie
unaffiliated
main
subordinate
partisan
partizan
tendentious
tendencious
nonpartisan
nonpartizan
bipartisan
bipartizan
unbiased
unbiassed
aligned
allied
nonaligned
descriptive
prescriptive
normative
undescriptive
desirable
coveted
desired
delectable
enviable
preferable
preferred
undesirable
unwanted
unenviable
destroyed
annihilated
exterminated
blighted
spoilt
obliterate
obliterated
impoverished
demolished
dismantled
razed
despoiled
pillaged
raped
ravaged
sacked
kaput
extinguished
finished
ruined
scorched
shattered
tattered
totaled
wrecked
preserved
conserved
maintained
preservable
protected
saved
retained
destructible
abolishable
destroyable
indestructible
undestroyable
determinable
ascertainable
discoverable
definable
judicable
undeterminable
unascertainable
undiscoverable
undetermined
cymose
racemose
developed
formulated
mature
matured
undeveloped
budding
vestigial
dextral
dexter
dextrorse
dextrorsal
sinistral
sinistrorse
sinistrorsal
diabatic
adiabatic
differentiated
undifferentiated
uniform
dedifferentiated
difficult
hard
challenging
arduous
embarrassing
baffling
problematic
problematical
ticklish
touchy
fractious
herculean
rocky
troublesome
vexed
effortless
cushy
elementary
simple
uncomplicated
unproblematic
painless
simplified
digitigrade
plantigrade
dignified
courtly
formal
stately
distinguished
grand
imposing
magisterial
undignified
demeaning
humbling
humiliating
mortifying
pathetic
ridiculous
statesmanlike
statesmanly
unstatesmanlike
presidential
unpresidential
dicotyledonous
monocotyledonous
diligent
assiduous
sedulous
hardworking
industrious
tireless
untiring
negligent
neglectful
remiss
slack
diluted
dilute
thinned
watery
undiluted
monounsaturated
polyunsaturated
supersaturated
diplomatic
diplomatical
politic
suave
bland
tactful
undiplomatic
conciliatory
conciliative
appeasing
placating
placative
placatory
pacific
propitiative
propitiatory
alienating
straightforward
through
indirect
askance
askant
asquint
squint
squinty
sidelong
devious
circuitous
roundabout
diversionary
meandering
rambling
wandering
winding
bluff
candid
forthright
frank
plainspoken
brutal
unvarnished
pointed
upfront
allusive
backhanded
circumlocutious
circumlocutory
periphrastic
ambagious
oblique
digressive
discursive
excursive
hearsay
mealymouthed
tortuous
reciprocal
unmediated
mediate
mediated
discerning
percipient
perspicacious
prescient
undiscerning
purblind
uncomprehending
discreet
indiscreet
bigmouthed
blabby
imprudent
discriminate
indiscriminate
sweeping
wholesale
discriminating
appreciative
diacritic
diacritical
eclectic
selective
undiscriminating
indiscriminating
scattershot
unperceptive
unselective
disposable
throwaway
nondisposable
returnable
revertible
nonreturnable
usable
useable
expendable
spendable
distal
proximal
lateral
mesial
sagittal
chiseled
outlined
knifelike
indistinct
bedimmed
bleary
blurry
nebulose
wispy
veiled
diversified
undiversified
monolithic
undistributed
divisible
cleavable
dissociable
separable
severable
dissociative
dividable
partible
indivisible
indiscrete
undividable
inseparable
documented
referenced
registered
undocumented
unregistered
domineering
overbearing
bossy
dominating
bullying
cavalier
roughshod
oppressive
tyrannous
submissive
abject
bowed
bowing
meek
spiritless
cringing
groveling
grovelling
wormlike
wormy
henpecked
servile
bootlicking
fawning
sycophantic
toadyish
obsequious
slavish
subservient
slavelike
unservile
unsubmissive
dominant
ascendant
ascendent
controlling
governing
overriding
paramount
predominant
